---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Sarah/Documents/_NYU/Thesis/Rerun.log
  log type:  text
 opened on:  12 May 2015, 16:30:01

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. use "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHDemoCoded.dta", clear
(National Longitudinal Study of Adolescent Health (Add Health), 1994-2008, Wave 1)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. global ed "h1rm1 h1rf1 h2rm1"

. foreach i of varlist $ed{
  2. recode `i' (10=0)
  3. tab `i', m
  4. }
(h1rm1: 7 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          7        0.11        0.11
                      8th grade or less |        263        4.04        4.15
 >8th grade/didn't graduate high school |        568        8.73       12.88
Business/trade/voc. school instead high |         41        0.63       13.51
                   High school graduate |      1,811       27.84       41.36
                                    GED |        217        3.34       44.70
Business/trade/voc. school after high s |        426        6.55       51.25
                College/didn't graduate |        770       11.84       63.08
      Graduated from college/university |      1,241       19.08       82.16
Prof training beyond 4-year college/uni |        512        7.87       90.04
 Went to school/Resp doesn't know level |        179        2.75       92.79
Resp doesn't know if she went to school |         42        0.65       93.43
                                Refused |          4        0.06       93.50
               Legitimate skip (no MOM) |        370        5.69       99.19
                             Don't know |         53        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h1rf1: 9 changes made)

       S15Q1 RES DAD-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          9        0.14        0.14
                      8th grade or less |        219        3.37        3.51
 >8th grade/didn't graduate high school |        379        5.83        9.33
Business/trade/voc. school instead high |         27        0.42        9.75
                   High school graduate |      1,302       20.02       29.77
                                    GED |        130        2.00       31.77
Business/trade/voc. school after high s |        254        3.91       35.67
                College/didn't graduate |        512        7.87       43.54
      Graduated from college/university |        922       14.18       57.72
Prof training beyond 4-year college/uni |        535        8.23       65.94
 Went to school/Resp doesn't know level |        155        2.38       68.33
 Resp doesn't know if he went to school |         50        0.77       69.10
                                Refused |          7        0.11       69.20
                        Legitimate skip |      1,952       30.01       99.22
                             Don't know |         50        0.77       99.98
                         Not applicable |          1        0.02      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h2rm1: 1 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.02        0.02
                      8th grade or less |         11        0.17        0.18
 >8th grade/didn't graduate high school |         45        0.69        0.88
Business/trade/voc school instead high  |          2        0.03        0.91
                   High school graduate |        110        1.69        2.60
                                    GED |          8        0.12        2.72
Business/trade/voc school after high sc |         20        0.31        3.03
                College/didn't graduate |         37        0.57        3.60
      Graduated from college/university |         59        0.91        4.50
Prof training beyond 4-year college/uni |         31        0.48        4.98
 Went to school/Resp doesn't know level |         23        0.35        5.34
Resp doesn't know if she went to school |         14        0.22        5.55
               Legitimate skip (no MOM) |      4,473       68.77       74.32
                                      . |      1,670       25.68      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label define mom 1 "1 Biological resident mother" 2 "2 Biological-nonresident mother (no resident mother)" 3 
> "3 Non resident biological mother and resident nonbiological mother" 4 "4 Resident mother serves as mother fi
> gure (no biological mother)" 5 "5 No mother figure identified" 

. gen momtype1=.
(6504 missing values generated)

. label var momtype1 "Description of mother whose SEP being measured in Wave 1"

. label values momtype1 mom

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=1 if h1nm1==7
(5665 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1nm4 if h1nm4!=97, m

    S12Q4 EDUCATION LEVEL OF BIO MOM-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      8th grade or less |         43        5.81        5.81
 >8th grade/didn't graduate high school |        114       15.41       21.22
Business/trade/voc. school instead high |          6        0.81       22.03
                   High school graduate |        232       31.35       53.38
                                    GED |         38        5.14       58.51
Business/trade/voc. school after high s |         41        5.54       64.05
                College/didn't graduate |         76       10.27       74.32
      Graduated from college/university |         87       11.76       86.08
Prof training beyond 4-year college/uni |         27        3.65       89.73
 Went to school/Resp doesn't know level |         33        4.46       94.19
Resp doesn't know if mom went to school |         30        4.05       98.24
                                Refused |          3        0.41       98.65
                             Don't know |         10        1.35      100.00
----------------------------------------+-----------------------------------
                                  Total |        740      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=2 if h1nm4<=9
(664 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        664       10.21       97.31
                                      . |        175        2.69      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. drop momtype1

. label drop mom

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label define mom 1 "1 Biological resident mother" 2 "2 Biological-nonresident mother (no resident mother)" 3 
> "3 Non resident biological mother and resident nonbiological mother (Placeholder)" 4 "4 Resident mother serve
> s as mother figure (no biological mother)" 5 "5 No mother figure identified" 

. 
end of do-file

. drop momtype1
variable momtype1 not found
r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen momtype1=.
(6504 missing values generated)

. label var momtype1 "Description of mother whose SEP being measured in Wave 1"

. label values momtype1 mom

. 
. *Coding for momtype1
. *Biological resident
. replace momtype1=1 if h1nm1==7
(5665 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1nm4 if h1nm4!=97, m

    S12Q4 EDUCATION LEVEL OF BIO MOM-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      8th grade or less |         43        5.81        5.81
 >8th grade/didn't graduate high school |        114       15.41       21.22
Business/trade/voc. school instead high |          6        0.81       22.03
                   High school graduate |        232       31.35       53.38
                                    GED |         38        5.14       58.51
Business/trade/voc. school after high s |         41        5.54       64.05
                College/didn't graduate |         76       10.27       74.32
      Graduated from college/university |         87       11.76       86.08
Prof training beyond 4-year college/uni |         27        3.65       89.73
 Went to school/Resp doesn't know level |         33        4.46       94.19
Resp doesn't know if mom went to school |         30        4.05       98.24
                                Refused |          3        0.41       98.65
                             Don't know |         10        1.35      100.00
----------------------------------------+-----------------------------------
                                  Total |        740      100.00

. replace momtype1=2 if h1nm4<=9 & h1hr12==0
(98 real changes made)

. replace momtype1=2 if h1nm4<=9 & h1pf1==7
(215 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
                                      . |        526        8.09      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=5 if momtype1=. & h1nm1!=1 & h1nm1!=7 & h1hr12==0
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1hr12==0
(7 real changes made)

. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1pf1==7
(22 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
          5 No mother figure identified |         29        0.45       92.36
                                      . |        497        7.64      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace momtype1=4 if momtype1==. & h1hr3`x'==14 & h1hr6`x'>=8 & h1hr6`x'!=97
  3. }
(92 real changes made)
(98 real changes made)
(17 real changes made)
(9 real changes made)
(10 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        227        3.49       95.40
          5 No mother figure identified |         29        0.45       95.85
                                      . |        270        4.15      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==. & h1nm4>=11 & h1nm4!=97 & h1rm1<=9
(10 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        237        3.64       95.56
          5 No mother figure identified |         29        0.45       96.00
                                      . |        260        4.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=2 if momtype1==. & h1rm1>=11 & h1rm1!=97 & momtype1==3 & h1nm4<=9
(0 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        237        3.64       95.56
          5 No mother figure identified |         29        0.45       96.00
                                      . |        260        4.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=2 if momtype1==. & h1rm1>=11 & h1rm1!=97 & h1nm4<=9
(26 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        339        5.21       92.31
4 Resident mother serves as mother figu |        237        3.64       95.96
          5 No mother figure identified |         29        0.45       96.40
                                      . |        234        3.60      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=2 if momtype1==. & h1nm4>=h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(120 real changes made)

. replace momtype1=4 if momtype1==. & h1nm4<h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(60 real changes made)

. 
. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        459        7.06       94.16
4 Resident mother serves as mother figu |        297        4.57       98.72
          5 No mother figure identified |         29        0.45       99.17
                                      . |         54        0.83      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen dadtype1=.
(6504 missing values generated)

. label define dad 1 "1 Biological father is resident father" 2 "2 Biological-nonresident father (no resident f
> ather)" 3 "3 Biological nonresident father and/or resident nonbiological father (Placeholder)" 4 "4 Resident 
> father serves as father (no biological father)" 5 "5 No father figure identified"

. label values dadtype1 dad

. label var dadtype1 "Description of father whose SEP being measured in W1"

. 
. *Biological resident
. replace dadtype1=1 if h1nf1==7
(3766 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=2 if h1nf4<=9 & h1hr12==0
(79 real changes made)

. replace dadtype1=2 if h1nf4<=9 & h1pf23==7
(1338 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
                                      . |      1,321       20.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1hr12==0
(20 real changes made)

. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1pf23==7
(291 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
          5 No father figure identified |        311        4.78       84.47
                                      . |      1,010       15.53      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace dadtype1=4 if dadtype==. & h1hr3`x'==11 & h1hr6`x'>=2 & h1hr6`x'<=6
  3. }
(167 real changes made)
(346 real changes made)
(66 real changes made)
(34 real changes made)
(16 real changes made)
(4 real changes made)
(6 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        642        9.87       89.56
          5 No father figure identified |        311        4.78       94.34
                                      . |        368        5.66      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if dadtype1==. & h1nf4>=11 & h1nf4!=97 &  & h1rf1<=9
97& invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if dadtype1==. & h1nf4>=11 & h1nf4!=97 &  h1rf1<=9
(11 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        653       10.04       89.73
          5 No father figure identified |        311        4.78       94.51
                                      . |        357        5.49      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=2 if dadtype1==. & h1nf4<=9 & h1rf1>=9 & h1rf1!=97 
(14 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,431       22.00       79.90
4 Resident father serves as father (no  |        653       10.04       89.94
          5 No father figure identified |        311        4.78       94.73
                                      . |        343        5.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=2 if dadtype1==. & h1nf4>=h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(52 real changes made)

. replace dadtype1=4 if dadtype1==. & h1nf4<h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(17 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,483       22.80       80.70
4 Resident father serves as father (no  |        670       10.30       91.01
          5 No father figure identified |        311        4.78       95.79
                                      . |        274        4.21      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195        174         21         32         37 |       459 
4 Resident mother ser |       128         48         78         24         19 |       297 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        670        311        274 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 if momtype1==. & dadtype1==.

S11Q12 WHO ACTS AS THE MOTHER TO YOU-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                 No one |          4       21.05       21.05
                   1st household member |         10       52.63       73.68
                   2nd household member |          2       10.53       84.21
                   3rd household member |          2       10.53       94.74
                             Don't know |          1        5.26      100.00
----------------------------------------+-----------------------------------
                                  Total |         19      100.00

. replace momtype1=4 if momtype1==. & dadtype1==. & h1hr12>=1 & h1hr12<=8
(14 real changes made)

. replace dadtype1=4 if momtype1==. & dadtype1==. & h1hr13>=1 & h1hr13<=8
(0 real changes made)

. replace dadtype1=4 if dadtype1==. & h1hr13>=1 & h1hr13<=8
(44 real changes made)

. 
. tab momtype1 dadtype1, m /*Down to no mutual missing*/

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195        174         41         32         17 |       459 
4 Resident mother ser |       128         48        102         24          9 |       311 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4          5 |        40 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        714        311        230 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2

   S11Q12 WHO ACTS AS |              S11Q13 WHO ACTS AS THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  2nd house  3rd house  4th house  Legitimat |     Total
----------------------+------------------------------------------------------------------+----------
               No one |        71          3          0          0          0          0 |        74 
 1st household member |        36          7         21          4          0          0 |        68 
 2nd household member |         3         12          1          1          0          0 |        17 
 3rd household member |         3          0          1          0          1          0 |         5 
 4th household member |         1          0          0          0          0          0 |         1 
Legitimate skip (list |         0          0          0          0          0          9 |         9 
----------------------+------------------------------------------------------------------+----------
                Total |       114         22         23          5          1          9 |       174 


. 
end of do-file

. drop momtype1 dadtype1

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. use "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHDemoCoded.dta", clear
(National Longitudinal Study of Adolescent Health (Add Health), 1994-2008, Wave 1)

. 
. /*Logic - Identifies parent type and corresponding Wave 1 education, tries to
> matches Wave 2 education with same person.
> Identifies household composition in wave 1 and will look for any changes in Wave II
> */
. *recode h1rm1, h1rf1 h2rm1 so 10=0
. global ed "h1rm1 h1rf1 h2rm1"

. foreach i of varlist $ed{
  2. recode `i' (10=0)
  3. tab `i', m
  4. }
(h1rm1: 7 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          7        0.11        0.11
                      8th grade or less |        263        4.04        4.15
 >8th grade/didn't graduate high school |        568        8.73       12.88
Business/trade/voc. school instead high |         41        0.63       13.51
                   High school graduate |      1,811       27.84       41.36
                                    GED |        217        3.34       44.70
Business/trade/voc. school after high s |        426        6.55       51.25
                College/didn't graduate |        770       11.84       63.08
      Graduated from college/university |      1,241       19.08       82.16
Prof training beyond 4-year college/uni |        512        7.87       90.04
 Went to school/Resp doesn't know level |        179        2.75       92.79
Resp doesn't know if she went to school |         42        0.65       93.43
                                Refused |          4        0.06       93.50
               Legitimate skip (no MOM) |        370        5.69       99.19
                             Don't know |         53        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h1rf1: 9 changes made)

       S15Q1 RES DAD-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          9        0.14        0.14
                      8th grade or less |        219        3.37        3.51
 >8th grade/didn't graduate high school |        379        5.83        9.33
Business/trade/voc. school instead high |         27        0.42        9.75
                   High school graduate |      1,302       20.02       29.77
                                    GED |        130        2.00       31.77
Business/trade/voc. school after high s |        254        3.91       35.67
                College/didn't graduate |        512        7.87       43.54
      Graduated from college/university |        922       14.18       57.72
Prof training beyond 4-year college/uni |        535        8.23       65.94
 Went to school/Resp doesn't know level |        155        2.38       68.33
 Resp doesn't know if he went to school |         50        0.77       69.10
                                Refused |          7        0.11       69.20
                        Legitimate skip |      1,952       30.01       99.22
                             Don't know |         50        0.77       99.98
                         Not applicable |          1        0.02      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h2rm1: 1 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.02        0.02
                      8th grade or less |         11        0.17        0.18
 >8th grade/didn't graduate high school |         45        0.69        0.88
Business/trade/voc school instead high  |          2        0.03        0.91
                   High school graduate |        110        1.69        2.60
                                    GED |          8        0.12        2.72
Business/trade/voc school after high sc |         20        0.31        3.03
                College/didn't graduate |         37        0.57        3.60
      Graduated from college/university |         59        0.91        4.50
Prof training beyond 4-year college/uni |         31        0.48        4.98
 Went to school/Resp doesn't know level |         23        0.35        5.34
Resp doesn't know if she went to school |         14        0.22        5.55
               Legitimate skip (no MOM) |      4,473       68.77       74.32
                                      . |      1,670       25.68      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. 
. *Identify parent composition: Wave 1
. *Mother
. label define mom 1 "1 Biological resident mother" 2 "2 Biological-nonresident mother (no resident 
> mother)" 3 "3 Non resident biological mother and resident nonbiological mother (Placeholder)" 4 "4
>  Resident mother serves as mother figure (no biological mother)" 5 "5 No mother figure identified"
>  

. gen momtype1=.
(6504 missing values generated)

. label var momtype1 "Description of mother whose SEP being measured in Wave 1"

. label values momtype1 mom

. 
. *Coding for momtype1
. *Biological resident
. replace momtype1=1 if h1nm1==7
(5665 real changes made)

. 
. *Information on how many nonres biol mothers years of schooling where there is also no resident mo
> ther?
. tab h1nm4 if h1nm4!=97, m

    S12Q4 EDUCATION LEVEL OF BIO MOM-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      8th grade or less |         43        5.81        5.81
 >8th grade/didn't graduate high school |        114       15.41       21.22
Business/trade/voc. school instead high |          6        0.81       22.03
                   High school graduate |        232       31.35       53.38
                                    GED |         38        5.14       58.51
Business/trade/voc. school after high s |         41        5.54       64.05
                College/didn't graduate |         76       10.27       74.32
      Graduated from college/university |         87       11.76       86.08
Prof training beyond 4-year college/uni |         27        3.65       89.73
 Went to school/Resp doesn't know level |         33        4.46       94.19
Resp doesn't know if mom went to school |         30        4.05       98.24
                                Refused |          3        0.41       98.65
                             Don't know |         10        1.35      100.00
----------------------------------------+-----------------------------------
                                  Total |        740      100.00

. replace momtype1=2 if h1nm4<=9 & h1hr12==0
(98 real changes made)

. replace momtype1=2 if h1nm4<=9 & h1pf1==7
(215 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
                                      . |        526        8.09      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *No resident mother figure nor biological nonresident mother identified
. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1hr12==0
(7 real changes made)

. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1pf1==7
(22 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
          5 No mother figure identified |         29        0.45       92.36
                                      . |        497        7.64      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. * 3 Resident nonbiological mothers
. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace momtype1=4 if momtype1==. & h1hr3`x'==14 & h1hr6`x'>=8 & h1hr6`x'!=97
  3. }
(92 real changes made)
(98 real changes made)
(17 real changes made)
(9 real changes made)
(10 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        227        3.49       95.40
          5 No mother figure identified |         29        0.45       95.85
                                      . |        270        4.15      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know biological mother's education, use resident mother's.
. replace momtype1=4 if momtype1==. & h1nm4>=11 & h1nm4!=97 & h1rm1<=9
(10 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        237        3.64       95.56
          5 No mother figure identified |         29        0.45       96.00
                                      . |        260        4.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know nonbiores mother's education, use biomom's
. replace momtype1=2 if momtype1==. & h1rm1>=11 & h1rm1!=97 & h1nm4<=9
(26 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        339        5.21       92.31
4 Resident mother serves as mother figu |        237        3.64       95.96
          5 No mother figure identified |         29        0.45       96.40
                                      . |        234        3.60      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If information available on both biological and resident mother's educations, use higher value
. tab h1nm4 h1rm1, m

S12Q4 EDUCATION LEVEL |            S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 |         0  8th grade  >8th grad  Business/  High scho |     Total
----------------------+-------------------------------------------------------+----------
    8th grade or less |         0          6          2          1          5 |        43 
>8th grade/didn't gra |         0          8         16          0         22 |       114 
Business/trade/voc. s |         0          0          0          0          0 |         6 
 High school graduate |         1          8         12          0         56 |       232 
                  GED |         0          2          3          0          8 |        38 
Business/trade/voc. s |         0          1          3          0          5 |        41 
College/didn't gradua |         0          1          1          0         10 |        76 
Graduated from colleg |         0          0          3          0          6 |        87 
Prof training beyond  |         0          0          0          0          1 |        27 
Went to school/Resp d |         0          3          2          0          7 |        33 
Resp doesn't know if  |         0          0          1          0          3 |        30 
              Refused |         0          0          0          0          0 |         3 
      Legitimate skip |         6        234        524         40      1,688 |     5,764 
           Don't know |         0          0          1          0          0 |        10 
----------------------+-------------------------------------------------------+----------
                Total |         7        263        568         41      1,811 |     6,504 


S12Q4 EDUCATION LEVEL |            S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 |       GED  Business/  College/d  Graduated  Prof trai |     Total
----------------------+-------------------------------------------------------+----------
    8th grade or less |         0          0          2          1          0 |        43 
>8th grade/didn't gra |         2          1          1          2          1 |       114 
Business/trade/voc. s |         0          0          1          0          0 |         6 
 High school graduate |         5         10         13         17          3 |       232 
                  GED |         1          1          0          0          1 |        38 
Business/trade/voc. s |         0          5          2          2          1 |        41 
College/didn't gradua |         0          2          8          7          6 |        76 
Graduated from colleg |         0          2          5         14          7 |        87 
Prof training beyond  |         0          1          0          3          4 |        27 
Went to school/Resp d |         0          1          2          1          1 |        33 
Resp doesn't know if  |         0          0          2          6          2 |        30 
              Refused |         0          0          1          0          0 |         3 
      Legitimate skip |       209        402        731      1,188        486 |     5,764 
           Don't know |         0          1          2          0          0 |        10 
----------------------+-------------------------------------------------------+----------
                Total |       217        426        770      1,241        512 |     6,504 


S12Q4 EDUCATION LEVEL |            S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 | Went to s  Resp does    Refused  Legitimat  Don't kno |     Total
----------------------+-------------------------------------------------------+----------
    8th grade or less |         2          3          0         21          0 |        43 
>8th grade/didn't gra |         3          1          0         56          1 |       114 
Business/trade/voc. s |         0          0          0          5          0 |         6 
 High school graduate |         6          3          0         96          2 |       232 
                  GED |         3          0          0         19          0 |        38 
Business/trade/voc. s |         3          2          0         17          0 |        41 
College/didn't gradua |         3          1          0         37          0 |        76 
Graduated from colleg |         4          1          0         44          1 |        87 
Prof training beyond  |         0          0          0         18          0 |        27 
Went to school/Resp d |         4          0          0         12          0 |        33 
Resp doesn't know if  |         2          4          0         10          0 |        30 
              Refused |         0          0          0          2          0 |         3 
      Legitimate skip |       149         27          4         29         47 |     5,764 
           Don't know |         0          0          0          4          2 |        10 
----------------------+-------------------------------------------------------+----------
                Total |       179         42          4        370         53 |     6,504 


. replace momtype1=2 if momtype1==. & h1nm4>=h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(120 real changes made)

. replace momtype1=4 if momtype1==. & h1nm4<h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(60 real changes made)

. 
. tab momtype1, m /*54 missing cases*/

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        459        7.06       94.16
4 Resident mother serves as mother figu |        297        4.57       98.72
          5 No mother figure identified |         29        0.45       99.17
                                      . |         54        0.83      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. // Apply dad code and see for how many both missing.
. *Coding for dadtype1
. gen dadtype1=.
(6504 missing values generated)

. label define dad 1 "1 Biological father is resident father" 2 "2 Biological-nonresident father (no
>  resident father)" 3 "3 Biological nonresident father and/or resident nonbiological father (Placeh
> older)" 4 "4 Resident father serves as father (no biological father)" 5 "5 No father figure identi
> fied"

. label values dadtype1 dad

. label var dadtype1 "Description of father whose SEP being measured in W1"

. 
. *Biological resident
. replace dadtype1=1 if h1nf1==7
(3766 real changes made)

. 
. *Information on how many nonres biol fathers years of schooling where there is also no resident fa
> ther?
. *tab h1nf4 if h1nf4!=97, m
. replace dadtype1=2 if h1nf4<=9 & h1hr12==0
(79 real changes made)

. replace dadtype1=2 if h1nf4<=9 & h1pf23==7
(1338 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
                                      . |      1,321       20.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *No resident father figure nor biological nonresident father identified
. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1hr12==0
(20 real changes made)

. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1pf23==7
(291 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
          5 No father figure identified |        311        4.78       84.47
                                      . |      1,010       15.53      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *Resident nonbiological fathers
. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace dadtype1=4 if dadtype==. & h1hr3`x'==11 & h1hr6`x'>=2 & h1hr6`x'<=6
  3. }
(167 real changes made)
(346 real changes made)
(66 real changes made)
(34 real changes made)
(16 real changes made)
(4 real changes made)
(6 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        642        9.87       89.56
          5 No father figure identified |        311        4.78       94.34
                                      . |        368        5.66      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know biological father's education, use resident father's.
. replace dadtype1=4 if dadtype1==. & h1nf4>=11 & h1nf4!=97 &  h1rf1<=9
(11 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        653       10.04       89.73
          5 No father figure identified |        311        4.78       94.51
                                      . |        357        5.49      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know resident father's education, use biological father's
. replace dadtype1=2 if dadtype1==. & h1nf4<=9 & h1rf1>=9 & h1rf1!=97 
(14 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,431       22.00       79.90
4 Resident father serves as father (no  |        653       10.04       89.94
          5 No father figure identified |        311        4.78       94.73
                                      . |        343        5.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If information on both biological and resident father's educations, use higher value
. replace dadtype1=2 if dadtype1==. & h1nf4>=h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(52 real changes made)

. replace dadtype1=4 if dadtype1==. & h1nf4<h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(17 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,483       22.80       80.70
4 Resident father serves as father (no  |        670       10.30       91.01
          5 No father figure identified |        311        4.78       95.79
                                      . |        274        4.21      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. *274 missing
. 
. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195        174         21         32         37 |       459 
4 Resident mother ser |       128         48         78         24         19 |       297 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        670        311        274 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

   S11Q12 WHO ACTS AS |        S11Q13 WHO ACTS AS THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  2nd house  3rd house  4th house |     Total
----------------------+-------------------------------------------------------+----------
               No one |        71          3          0          0          0 |        74 
 1st household member |        36          7         21          4          0 |        68 
 2nd household member |         3         12          1          1          0 |        17 
 3rd household member |         3          0          1          0          1 |         5 
 4th household member |         1          0          0          0          0 |         1 
Legitimate skip (list |         0          0          0          0          0 |         9 
----------------------+-------------------------------------------------------+----------
                Total |       114         22         23          5          1 |       174 


                      | S11Q13 WHO
                      |  ACTS AS
                      | THE FATHER
   S11Q12 WHO ACTS AS | TO YOU-W1
 THE MOTHER TO YOU-W1 | Legitimat |     Total
----------------------+-----------+----------
               No one |         0 |        74 
 1st household member |         0 |        68 
 2nd household member |         0 |        17 
 3rd household member |         0 |         5 
 4th household member |         0 |         1 
Legitimate skip (list |         9 |         9 
----------------------+-----------+----------
                Total |         9 |       174 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==2 & dadtype1==2 & h1hr12>=1 & h1hr12<=8
(91 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         83         21         32         37 |       368 
4 Resident mother ser |       128        139         78         24         19 |       388 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        670        311        274 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

                      | S11Q13 WHO ACTS AS THE FATHER TO
   S11Q12 WHO ACTS AS |              YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  Legitimat |     Total
----------------------+---------------------------------+----------
               No one |        71          3          0 |        74 
Legitimate skip (list |         0          0          9 |         9 
----------------------+---------------------------------+----------
                Total |        71          3          9 |        83 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if momtype1==2 & dadtype1==2 & h1hr13>=1 & h1hr13<=6
(3 real changes made)

. 
end of do-file

. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         80         24         32         37 |       368 
4 Resident mother ser |       128        139         78         24         19 |       388 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,480        673        311        274 |     6,504 


. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

                      |  S11Q13 WHO ACTS AS
   S11Q12 WHO ACTS AS | THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  Legitimat |     Total
----------------------+----------------------+----------
               No one |        71          0 |        71 
Legitimate skip (list |         0          9 |         9 
----------------------+----------------------+----------
                Total |        71          9 |        80 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==2 & dadtype1==2 & h1hr12==97
(9 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if momtype1==2 & dadtype1==2 & h1hr13==97
(0 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if dadtype1==2 & h1hr13==97
(1273 real changes made)

. 
end of do-file

. drop momtype1 dadtype1

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. global ed "h1rm1 h1rf1 h2rm1"

. foreach i of varlist $ed{
  2. recode `i' (10=0)
  3. tab `i', m
  4. }
(h1rm1: 0 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          7        0.11        0.11
                      8th grade or less |        263        4.04        4.15
 >8th grade/didn't graduate high school |        568        8.73       12.88
Business/trade/voc. school instead high |         41        0.63       13.51
                   High school graduate |      1,811       27.84       41.36
                                    GED |        217        3.34       44.70
Business/trade/voc. school after high s |        426        6.55       51.25
                College/didn't graduate |        770       11.84       63.08
      Graduated from college/university |      1,241       19.08       82.16
Prof training beyond 4-year college/uni |        512        7.87       90.04
 Went to school/Resp doesn't know level |        179        2.75       92.79
Resp doesn't know if she went to school |         42        0.65       93.43
                                Refused |          4        0.06       93.50
               Legitimate skip (no MOM) |        370        5.69       99.19
                             Don't know |         53        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h1rf1: 0 changes made)

       S15Q1 RES DAD-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          9        0.14        0.14
                      8th grade or less |        219        3.37        3.51
 >8th grade/didn't graduate high school |        379        5.83        9.33
Business/trade/voc. school instead high |         27        0.42        9.75
                   High school graduate |      1,302       20.02       29.77
                                    GED |        130        2.00       31.77
Business/trade/voc. school after high s |        254        3.91       35.67
                College/didn't graduate |        512        7.87       43.54
      Graduated from college/university |        922       14.18       57.72
Prof training beyond 4-year college/uni |        535        8.23       65.94
 Went to school/Resp doesn't know level |        155        2.38       68.33
 Resp doesn't know if he went to school |         50        0.77       69.10
                                Refused |          7        0.11       69.20
                        Legitimate skip |      1,952       30.01       99.22
                             Don't know |         50        0.77       99.98
                         Not applicable |          1        0.02      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h2rm1: 0 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.02        0.02
                      8th grade or less |         11        0.17        0.18
 >8th grade/didn't graduate high school |         45        0.69        0.88
Business/trade/voc school instead high  |          2        0.03        0.91
                   High school graduate |        110        1.69        2.60
                                    GED |          8        0.12        2.72
Business/trade/voc school after high sc |         20        0.31        3.03
                College/didn't graduate |         37        0.57        3.60
      Graduated from college/university |         59        0.91        4.50
Prof training beyond 4-year college/uni |         31        0.48        4.98
 Went to school/Resp doesn't know level |         23        0.35        5.34
Resp doesn't know if she went to school |         14        0.22        5.55
               Legitimate skip (no MOM) |      4,473       68.77       74.32
                                      . |      1,670       25.68      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. 
. *Identify parent composition: Wave 1
. *Mother
. label define mom 1 "1 Biological resident mother" 2 "2 Biological-nonresident mother (no resident 
> mother)" 3 "3 Non resident biological mother and resident nonbiological mother (Placeholder)" 4 "4
>  Resident mother serves as mother figure (no biological mother)" 5 "5 No mother figure identified"
>  
label mom already defined
r(110);

end of do-file

r(110);

.  label drop mom dad

. clear

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. use "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHDemoCoded.dta", clear
(National Longitudinal Study of Adolescent Health (Add Health), 1994-2008, Wave 1)

. 
. /*Logic - Identifies parent type and corresponding Wave 1 education, tries to
> matches Wave 2 education with same person.
> Identifies household composition in wave 1 and will look for any changes in Wave II
> */
. *recode h1rm1, h1rf1 h2rm1 so 10=0
. global ed "h1rm1 h1rf1 h2rm1"

. foreach i of varlist $ed{
  2. recode `i' (10=0)
  3. tab `i', m
  4. }
(h1rm1: 7 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          7        0.11        0.11
                      8th grade or less |        263        4.04        4.15
 >8th grade/didn't graduate high school |        568        8.73       12.88
Business/trade/voc. school instead high |         41        0.63       13.51
                   High school graduate |      1,811       27.84       41.36
                                    GED |        217        3.34       44.70
Business/trade/voc. school after high s |        426        6.55       51.25
                College/didn't graduate |        770       11.84       63.08
      Graduated from college/university |      1,241       19.08       82.16
Prof training beyond 4-year college/uni |        512        7.87       90.04
 Went to school/Resp doesn't know level |        179        2.75       92.79
Resp doesn't know if she went to school |         42        0.65       93.43
                                Refused |          4        0.06       93.50
               Legitimate skip (no MOM) |        370        5.69       99.19
                             Don't know |         53        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h1rf1: 9 changes made)

       S15Q1 RES DAD-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          9        0.14        0.14
                      8th grade or less |        219        3.37        3.51
 >8th grade/didn't graduate high school |        379        5.83        9.33
Business/trade/voc. school instead high |         27        0.42        9.75
                   High school graduate |      1,302       20.02       29.77
                                    GED |        130        2.00       31.77
Business/trade/voc. school after high s |        254        3.91       35.67
                College/didn't graduate |        512        7.87       43.54
      Graduated from college/university |        922       14.18       57.72
Prof training beyond 4-year college/uni |        535        8.23       65.94
 Went to school/Resp doesn't know level |        155        2.38       68.33
 Resp doesn't know if he went to school |         50        0.77       69.10
                                Refused |          7        0.11       69.20
                        Legitimate skip |      1,952       30.01       99.22
                             Don't know |         50        0.77       99.98
                         Not applicable |          1        0.02      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h2rm1: 1 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.02        0.02
                      8th grade or less |         11        0.17        0.18
 >8th grade/didn't graduate high school |         45        0.69        0.88
Business/trade/voc school instead high  |          2        0.03        0.91
                   High school graduate |        110        1.69        2.60
                                    GED |          8        0.12        2.72
Business/trade/voc school after high sc |         20        0.31        3.03
                College/didn't graduate |         37        0.57        3.60
      Graduated from college/university |         59        0.91        4.50
Prof training beyond 4-year college/uni |         31        0.48        4.98
 Went to school/Resp doesn't know level |         23        0.35        5.34
Resp doesn't know if she went to school |         14        0.22        5.55
               Legitimate skip (no MOM) |      4,473       68.77       74.32
                                      . |      1,670       25.68      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. 
. *Identify parent composition: Wave 1
. *Mother
. label define mom 1 "1 Biological resident mother" 2 "2 Biological-nonresident mother (no resident 
> mother)" 3 "3 Non resident biological mother and resident nonbiological mother (Placeholder)" 4 "4
>  Resident mother serves as mother figure (no biological mother)" 5 "5 No mother figure identified"
>  

. gen momtype1=.
(6504 missing values generated)

. label var momtype1 "Description of mother whose SEP being measured in Wave 1"

. label values momtype1 mom

. 
. *Coding for momtype1
. *Biological resident
. replace momtype1=1 if h1nm1==7
(5665 real changes made)

. 
. *Information on how many nonres biol mothers years of schooling where there is also no resident mo
> ther?
. tab h1nm4 if h1nm4!=97, m

    S12Q4 EDUCATION LEVEL OF BIO MOM-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      8th grade or less |         43        5.81        5.81
 >8th grade/didn't graduate high school |        114       15.41       21.22
Business/trade/voc. school instead high |          6        0.81       22.03
                   High school graduate |        232       31.35       53.38
                                    GED |         38        5.14       58.51
Business/trade/voc. school after high s |         41        5.54       64.05
                College/didn't graduate |         76       10.27       74.32
      Graduated from college/university |         87       11.76       86.08
Prof training beyond 4-year college/uni |         27        3.65       89.73
 Went to school/Resp doesn't know level |         33        4.46       94.19
Resp doesn't know if mom went to school |         30        4.05       98.24
                                Refused |          3        0.41       98.65
                             Don't know |         10        1.35      100.00
----------------------------------------+-----------------------------------
                                  Total |        740      100.00

. replace momtype1=2 if h1nm4<=9 & h1hr12==0
(98 real changes made)

. replace momtype1=2 if h1nm4<=9 & h1pf1==7
(215 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
                                      . |        526        8.09      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *No resident mother figure nor biological nonresident mother identified
. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1hr12==0
(7 real changes made)

. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1pf1==7
(22 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
          5 No mother figure identified |         29        0.45       92.36
                                      . |        497        7.64      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. * 3 Resident nonbiological mothers
. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace momtype1=4 if momtype1==. & h1hr3`x'==14 & h1hr6`x'>=8 & h1hr6`x'!=97
  3. }
(92 real changes made)
(98 real changes made)
(17 real changes made)
(9 real changes made)
(10 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        227        3.49       95.40
          5 No mother figure identified |         29        0.45       95.85
                                      . |        270        4.15      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know biological mother's education, use resident mother's.
. replace momtype1=4 if momtype1==. & h1nm4>=11 & h1nm4!=97 & h1rm1<=9
(10 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        237        3.64       95.56
          5 No mother figure identified |         29        0.45       96.00
                                      . |        260        4.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know nonbiores mother's education, use biomom's
. replace momtype1=2 if momtype1==. & h1rm1>=11 & h1rm1!=97 & h1nm4<=9
(26 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        339        5.21       92.31
4 Resident mother serves as mother figu |        237        3.64       95.96
          5 No mother figure identified |         29        0.45       96.40
                                      . |        234        3.60      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If information available on both biological and resident mother's educations, use higher value
. tab h1nm4 h1rm1, m

S12Q4 EDUCATION LEVEL |            S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 |         0  8th grade  >8th grad  Business/  High scho |     Total
----------------------+-------------------------------------------------------+----------
    8th grade or less |         0          6          2          1          5 |        43 
>8th grade/didn't gra |         0          8         16          0         22 |       114 
Business/trade/voc. s |         0          0          0          0          0 |         6 
 High school graduate |         1          8         12          0         56 |       232 
                  GED |         0          2          3          0          8 |        38 
Business/trade/voc. s |         0          1          3          0          5 |        41 
College/didn't gradua |         0          1          1          0         10 |        76 
Graduated from colleg |         0          0          3          0          6 |        87 
Prof training beyond  |         0          0          0          0          1 |        27 
Went to school/Resp d |         0          3          2          0          7 |        33 
Resp doesn't know if  |         0          0          1          0          3 |        30 
              Refused |         0          0          0          0          0 |         3 
      Legitimate skip |         6        234        524         40      1,688 |     5,764 
           Don't know |         0          0          1          0          0 |        10 
----------------------+-------------------------------------------------------+----------
                Total |         7        263        568         41      1,811 |     6,504 


S12Q4 EDUCATION LEVEL |            S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 |       GED  Business/  College/d  Graduated  Prof trai |     Total
----------------------+-------------------------------------------------------+----------
    8th grade or less |         0          0          2          1          0 |        43 
>8th grade/didn't gra |         2          1          1          2          1 |       114 
Business/trade/voc. s |         0          0          1          0          0 |         6 
 High school graduate |         5         10         13         17          3 |       232 
                  GED |         1          1          0          0          1 |        38 
Business/trade/voc. s |         0          5          2          2          1 |        41 
College/didn't gradua |         0          2          8          7          6 |        76 
Graduated from colleg |         0          2          5         14          7 |        87 
Prof training beyond  |         0          1          0          3          4 |        27 
Went to school/Resp d |         0          1          2          1          1 |        33 
Resp doesn't know if  |         0          0          2          6          2 |        30 
              Refused |         0          0          1          0          0 |         3 
      Legitimate skip |       209        402        731      1,188        486 |     5,764 
           Don't know |         0          1          2          0          0 |        10 
----------------------+-------------------------------------------------------+----------
                Total |       217        426        770      1,241        512 |     6,504 


S12Q4 EDUCATION LEVEL |            S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 | Went to s  Resp does    Refused  Legitimat  Don't kno |     Total
----------------------+-------------------------------------------------------+----------
    8th grade or less |         2          3          0         21          0 |        43 
>8th grade/didn't gra |         3          1          0         56          1 |       114 
Business/trade/voc. s |         0          0          0          5          0 |         6 
 High school graduate |         6          3          0         96          2 |       232 
                  GED |         3          0          0         19          0 |        38 
Business/trade/voc. s |         3          2          0         17          0 |        41 
College/didn't gradua |         3          1          0         37          0 |        76 
Graduated from colleg |         4          1          0         44          1 |        87 
Prof training beyond  |         0          0          0         18          0 |        27 
Went to school/Resp d |         4          0          0         12          0 |        33 
Resp doesn't know if  |         2          4          0         10          0 |        30 
              Refused |         0          0          0          2          0 |         3 
      Legitimate skip |       149         27          4         29         47 |     5,764 
           Don't know |         0          0          0          4          2 |        10 
----------------------+-------------------------------------------------------+----------
                Total |       179         42          4        370         53 |     6,504 


. replace momtype1=2 if momtype1==. & h1nm4>=h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(120 real changes made)

. replace momtype1=4 if momtype1==. & h1nm4<h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(60 real changes made)

. 
. tab momtype1, m /*54 missing cases*/

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        459        7.06       94.16
4 Resident mother serves as mother figu |        297        4.57       98.72
          5 No mother figure identified |         29        0.45       99.17
                                      . |         54        0.83      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. // Apply dad code and see for how many both missing.
. *Coding for dadtype1
. gen dadtype1=.
(6504 missing values generated)

. label define dad 1 "1 Biological father is resident father" 2 "2 Biological-nonresident father (no
>  resident father)" 3 "3 Biological nonresident father and/or resident nonbiological father (Placeh
> older)" 4 "4 Resident father serves as father (no biological father)" 5 "5 No father figure identi
> fied"

. label values dadtype1 dad

. label var dadtype1 "Description of father whose SEP being measured in W1"

. 
. *Biological resident
. replace dadtype1=1 if h1nf1==7
(3766 real changes made)

. 
. *Information on how many nonres biol fathers years of schooling where there is also no resident fa
> ther?
. *tab h1nf4 if h1nf4!=97, m
. replace dadtype1=2 if h1nf4<=9 & h1hr12==0
(79 real changes made)

. replace dadtype1=2 if h1nf4<=9 & h1pf23==7
(1338 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
                                      . |      1,321       20.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *No resident father figure nor biological nonresident father identified
. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1hr12==0
(20 real changes made)

. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1pf23==7
(291 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
          5 No father figure identified |        311        4.78       84.47
                                      . |      1,010       15.53      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *Resident nonbiological fathers
. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace dadtype1=4 if dadtype1==. & h1hr3`x'==11 & h1hr6`x'>=2 & h1hr6`x'<=6
  3. }
(167 real changes made)
(346 real changes made)
(66 real changes made)
(34 real changes made)
(16 real changes made)
(4 real changes made)
(6 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        642        9.87       89.56
          5 No father figure identified |        311        4.78       94.34
                                      . |        368        5.66      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know biological father's education, use resident father's.
. replace dadtype1=4 if dadtype1==. & h1nf4>=11 & h1nf4!=97 &  h1rf1<=9
(11 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        653       10.04       89.73
          5 No father figure identified |        311        4.78       94.51
                                      . |        357        5.49      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know resident father's education, use biological father's
. replace dadtype1=2 if dadtype1==. & h1nf4<=9 & h1rf1>=9 & h1rf1!=97 
(14 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,431       22.00       79.90
4 Resident father serves as father (no  |        653       10.04       89.94
          5 No father figure identified |        311        4.78       94.73
                                      . |        343        5.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If information on both biological and resident father's educations, use higher value
. replace dadtype1=2 if dadtype1==. & h1nf4>=h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(52 real changes made)

. replace dadtype1=4 if dadtype1==. & h1nf4<h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(17 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,483       22.80       80.70
4 Resident father serves as father (no  |        670       10.30       91.01
          5 No father figure identified |        311        4.78       95.79
                                      . |        274        4.21      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. *274 missing
. 
. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195        174         21         32         37 |       459 
4 Resident mother ser |       128         48         78         24         19 |       297 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        670        311        274 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

   S11Q12 WHO ACTS AS |        S11Q13 WHO ACTS AS THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  2nd house  3rd house  4th house |     Total
----------------------+-------------------------------------------------------+----------
               No one |        71          3          0          0          0 |        74 
 1st household member |        36          7         21          4          0 |        68 
 2nd household member |         3         12          1          1          0 |        17 
 3rd household member |         3          0          1          0          1 |         5 
 4th household member |         1          0          0          0          0 |         1 
Legitimate skip (list |         0          0          0          0          0 |         9 
----------------------+-------------------------------------------------------+----------
                Total |       114         22         23          5          1 |       174 


                      | S11Q13 WHO
                      |  ACTS AS
                      | THE FATHER
   S11Q12 WHO ACTS AS | TO YOU-W1
 THE MOTHER TO YOU-W1 | Legitimat |     Total
----------------------+-----------+----------
               No one |         0 |        74 
 1st household member |         0 |        68 
 2nd household member |         0 |        17 
 3rd household member |         0 |         5 
 4th household member |         0 |         1 
Legitimate skip (list |         9 |         9 
----------------------+-----------+----------
                Total |         9 |       174 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==2 & dadtype1==2 & h1hr12>=1 & h1hr12<=8
(91 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==2 & dadtype1==2 & h1hr12==97
(9 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if momtype1==2 & dadtype1==2 & h1hr13>=1 & h1hr13<=6
(3 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         71         24         32         37 |       359 
4 Resident mother ser |       128        148         78         24         19 |       397 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,480        673        311        274 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

                      | S11Q13 WHO
                      |  ACTS AS
                      | THE FATHER
   S11Q12 WHO ACTS AS | TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one |     Total
----------------------+-----------+----------
               No one |        71 |        71 
----------------------+-----------+----------
                Total |        71 |        71 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h2hr13 if momtype1==. & dadtype1==.
variable h2hr13 not found
r(111);

end of do-file

r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==. & dadtype1==.

   S11Q12 WHO ACTS AS |        S11Q13 WHO ACTS AS THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  2nd house  4th house  Don't kno |     Total
----------------------+-------------------------------------------------------+----------
               No one |         4          0          0          0          0 |         4 
 1st household member |         2          3          4          1          0 |        10 
 2nd household member |         0          2          0          0          0 |         2 
 3rd household member |         1          1          0          0          0 |         2 
           Don't know |         0          0          0          0          1 |         1 
----------------------+-------------------------------------------------------+----------
                Total |         7          6          4          1          1 |        19 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==. & dadtype1==. & h1hr12>=1 & h1hr12<=8
(14 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if momtype1==. & dadtype1==. & h1hr13>=1 & h1hr13<=6
(0 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=4 if dadtype1==. & h1hr13>=1 & h1hr13<=8
(44 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 dadtype1, m /*Down to 5 mutual missing*/

Description of mother |    Description of father whose SEP being
      whose SEP being |               measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath |     Total
----------------------+--------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235 |     5,665 
2 Biological-nonresid |       195         71         44         32 |       359 
4 Resident mother ser |       128        148        102         24 |       411 
5 No mother figure id |        10          3          0         16 |        29 
                    . |        21          7          3          4 |        40 
----------------------+--------------------------------------------+----------
                Total |     3,766      1,480        717        311 |     6,504 


                      | Descriptio
                      |    n of
                      |   father
                      | whose SEP
                      |   being
Description of mother |  measured
      whose SEP being |   in W1
   measured in Wave 1 |         . |     Total
----------------------+-----------+----------
1 Biological resident |       199 |     5,665 
2 Biological-nonresid |        17 |       359 
4 Resident mother ser |         9 |       411 
5 No mother figure id |         0 |        29 
                    . |         5 |        40 
----------------------+-----------+----------
                Total |       230 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen bioresmom1=(momtype1==1)

. label var bioresmom1 "Biological resident mother at Wave 1"

. label values bioresmom1 binary

. gen biononresmom1=(momtype1==2)

. label var biononresmom1 "Biological nonresident  mother at Wave 1"

. label values biononresmom1 binary

. gen nonbioresmom1=(momtype1==4)

. label value nonbioresmom1 "Non biological resident mother at Wave 1"
"Non biological resident mother  invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label var nonbioresmom1 "Non biological resident mother at Wave 1"

. label values nonbioresmom1 binary

. gen nomom1=(momtype1==5)

. label var "No mother figure reported/known at Wave 1"
"No mother figure reported/known at Wave 1 invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen bioresmom1=(momtype1==1)
bioresmom1 already defined
r(110);

end of do-file

r(110);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen famtype1=.
(6504 missing values generated)

. label var "Family-Household Composition at Wave 1"
"Family-Household Composition at Wave 1 invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label var famtype1 "Family-Household Composition at Wave 1"

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label define family 1 "1 Lives with both bioparents" 2 "2 Lives with one biopare
> nt" 3 "3 Lives w/one bioparent and nonbiores parent"  4 "4 Lives with two nonbio
> logical parents" 5 "5 Other or unknown living arrangement" 

. label values famtype1 family

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=1 if momtype1==1 & dadtype1==1
(3412 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=2 if momtype1==1 & dadtype1==.
(199 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=2 if dadtype1==1 & momtype1==.
(21 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=2 if momtype1==1 & dadtype1==5
(235 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=2 if dadtype1==1 & momtype1==5
(10 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=2 if momtype1==1 & dadtype1==2
(1251 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=2 if dadtype1==1 & momtype1==2
(195 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=4 if momtype1==1 & dadtype1==4
(568 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=3 if momtype1==1 & dadtype1==4
(568 real changes made)

. replace famtype1=3 if momtype1==4 & dadtype1==1
(128 real changes made)

. 
. replace famtype1=4 if momtype1==4 & dadtype1==4
(102 real changes made)

. 
. replace famtype1=5 if momtype1==4 & dadtype1==.
(9 real changes made)

. replace famtype1=5 if dadtype1==4 & momtype1==.
(3 real changes made)

. replace famtype1=5 if momtype1==4 & dadtype1==2
(148 real changes made)

. replace famtype1=5 if momtype1==2 & dadtype1==4
(44 real changes made)

. 
. replace famtype1=5 if momtype1==2 & dadtype1==2
(71 real changes made)

. replace famtype1=5 if momtype1==. & dadtype1==.
(5 real changes made)

. replace famtype1=5 if momtype1==2 & dadtype1==.
(17 real changes made)

. replace famtype1=5 if momtype1==. & dadtype1==2
(7 real changes made)

. 
. tab momtype1 famtype1, m

Description of mother |
      whose SEP being |   Family-Household Composition at Wave 1
   measured in Wave 1 | 1 Lives w  2 Lives w  3 Lives w  4 Lives w |     Total
----------------------+--------------------------------------------+----------
1 Biological resident |     3,412      1,685        568          0 |     5,665 
2 Biological-nonresid |         0        195          0          0 |       359 
4 Resident mother ser |         0          0        128        102 |       411 
5 No mother figure id |         0         10          0          0 |        29 
                    . |         0         21          0          0 |        40 
----------------------+--------------------------------------------+----------
                Total |     3,412      1,911        696        102 |     6,504 


Description of mother |   Family-Household
      whose SEP being | Composition at Wave 1
   measured in Wave 1 | 5 Other o          . |     Total
----------------------+----------------------+----------
1 Biological resident |         0          0 |     5,665 
2 Biological-nonresid |       132         32 |       359 
4 Resident mother ser |       157         24 |       411 
5 No mother figure id |         0         19 |        29 
                    . |        15          4 |        40 
----------------------+----------------------+----------
                Total |       304         79 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab dadtype1 famtype1, m

Description of father |
      whose SEP being |              Family-Household Composition at Wave 1
       measured in W1 | 1 Lives w  2 Lives w  3 Lives w  4 Lives w  5 Other o          . |     Total
----------------------+------------------------------------------------------------------+----------
1 Biological father i |     3,412        226        128          0          0          0 |     3,766 
2 Biological-nonresid |         0      1,251          0          0        226          3 |     1,480 
4 Resident father ser |         0          0        568        102         47          0 |       717 
5 No father figure id |         0        235          0          0          0         76 |       311 
                    . |         0        199          0          0         31          0 |       230 
----------------------+------------------------------------------------------------------+----------
                Total |     3,412      1,911        696        102        304         79 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab dadtype1 famtype1 if momtype1==4, m

Description of father |
      whose SEP being |   Family-Household Composition at Wave 1
       measured in W1 | 3 Lives w  4 Lives w  5 Other o          . |     Total
----------------------+--------------------------------------------+----------
1 Biological father i |       128          0          0          0 |       128 
2 Biological-nonresid |         0          0        148          0 |       148 
4 Resident father ser |         0        102          0          0 |       102 
5 No father figure id |         0          0          0         24 |        24 
                    . |         0          0          9          0 |         9 
----------------------+--------------------------------------------+----------
                Total |       128        102        157         24 |       411 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. recode momtype1=5 if momtype1==. & dadtype1==.
=exp not allowed
r(101);

end of do-file

r(101);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=5 if momtype1==. & dadtype1==.
(5 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace dadtype1=5 if dadtype1==.
(230 real changes made)

. 
end of do-file

. drop dadtype1

. drop momtype1

. clear

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. /*Logic - Identifies parent type and corresponding Wave 1 education, tries to
> matches Wave 2 education with same person.
> Identifies household composition in wave 1 and will look for any changes in Wave II
> */
. *recode h1rm1, h1rf1 h2rm1 so 10=0
. global ed "h1rm1 h1rf1 h2rm1"

. foreach i of varlist $ed{
  2. recode `i' (10=0)
  3. tab `i', m
  4. }
no variables defined
r(111);

end of do-file

r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. use "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHDemoCoded.dta", clear
(National Longitudinal Study of Adolescent Health (Add Health), 1994-2008, Wave 1)

. 
. /*Logic - Identifies parent type and corresponding Wave 1 education, tries to
> matches Wave 2 education with same person.
> Identifies household composition in wave 1 and will look for any changes in Wave II
> */
. *recode h1rm1, h1rf1 h2rm1 so 10=0
. global ed "h1rm1 h1rf1 h2rm1"

. foreach i of varlist $ed{
  2. recode `i' (10=0)
  3. tab `i', m
  4. }
(h1rm1: 7 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          7        0.11        0.11
                      8th grade or less |        263        4.04        4.15
 >8th grade/didn't graduate high school |        568        8.73       12.88
Business/trade/voc. school instead high |         41        0.63       13.51
                   High school graduate |      1,811       27.84       41.36
                                    GED |        217        3.34       44.70
Business/trade/voc. school after high s |        426        6.55       51.25
                College/didn't graduate |        770       11.84       63.08
      Graduated from college/university |      1,241       19.08       82.16
Prof training beyond 4-year college/uni |        512        7.87       90.04
 Went to school/Resp doesn't know level |        179        2.75       92.79
Resp doesn't know if she went to school |         42        0.65       93.43
                                Refused |          4        0.06       93.50
               Legitimate skip (no MOM) |        370        5.69       99.19
                             Don't know |         53        0.81      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h1rf1: 9 changes made)

       S15Q1 RES DAD-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          9        0.14        0.14
                      8th grade or less |        219        3.37        3.51
 >8th grade/didn't graduate high school |        379        5.83        9.33
Business/trade/voc. school instead high |         27        0.42        9.75
                   High school graduate |      1,302       20.02       29.77
                                    GED |        130        2.00       31.77
Business/trade/voc. school after high s |        254        3.91       35.67
                College/didn't graduate |        512        7.87       43.54
      Graduated from college/university |        922       14.18       57.72
Prof training beyond 4-year college/uni |        535        8.23       65.94
 Went to school/Resp doesn't know level |        155        2.38       68.33
 Resp doesn't know if he went to school |         50        0.77       69.10
                                Refused |          7        0.11       69.20
                        Legitimate skip |      1,952       30.01       99.22
                             Don't know |         50        0.77       99.98
                         Not applicable |          1        0.02      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00
(h2rm1: 1 changes made)

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.02        0.02
                      8th grade or less |         11        0.17        0.18
 >8th grade/didn't graduate high school |         45        0.69        0.88
Business/trade/voc school instead high  |          2        0.03        0.91
                   High school graduate |        110        1.69        2.60
                                    GED |          8        0.12        2.72
Business/trade/voc school after high sc |         20        0.31        3.03
                College/didn't graduate |         37        0.57        3.60
      Graduated from college/university |         59        0.91        4.50
Prof training beyond 4-year college/uni |         31        0.48        4.98
 Went to school/Resp doesn't know level |         23        0.35        5.34
Resp doesn't know if she went to school |         14        0.22        5.55
               Legitimate skip (no MOM) |      4,473       68.77       74.32
                                      . |      1,670       25.68      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. 
. *Identify parent composition: Wave 1
. *Mother
. label define mom 1 "1 Biological resident mother" 2 "2 Biological-nonresident mother (no resident m
> other)" 3 "3 Non resident biological mother and resident nonbiological mother (Placeholder)" 4 "4 R
> esident mother serves as mother figure (no biological mother)" 5 "5 No mother figure identified" 

. gen momtype1=.
(6504 missing values generated)

. label var momtype1 "Description of mother whose SEP being measured in Wave 1"

. label values momtype1 mom

. 
. *Coding for momtype1
. *Biological resident
. replace momtype1=1 if h1nm1==7
(5665 real changes made)

. 
. *Information on how many nonres biol mothers years of schooling where there is also no resident mot
> her?
. tab h1nm4 if h1nm4!=97, m

    S12Q4 EDUCATION LEVEL OF BIO MOM-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      8th grade or less |         43        5.81        5.81
 >8th grade/didn't graduate high school |        114       15.41       21.22
Business/trade/voc. school instead high |          6        0.81       22.03
                   High school graduate |        232       31.35       53.38
                                    GED |         38        5.14       58.51
Business/trade/voc. school after high s |         41        5.54       64.05
                College/didn't graduate |         76       10.27       74.32
      Graduated from college/university |         87       11.76       86.08
Prof training beyond 4-year college/uni |         27        3.65       89.73
 Went to school/Resp doesn't know level |         33        4.46       94.19
Resp doesn't know if mom went to school |         30        4.05       98.24
                                Refused |          3        0.41       98.65
                             Don't know |         10        1.35      100.00
----------------------------------------+-----------------------------------
                                  Total |        740      100.00

. replace momtype1=2 if h1nm4<=9 & h1hr12==0
(98 real changes made)

. replace momtype1=2 if h1nm4<=9 & h1pf1==7
(215 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
                                      . |        526        8.09      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *No resident mother figure nor biological nonresident mother identified
. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1hr12==0
(7 real changes made)

. replace momtype1=5 if momtype1==. & h1nm1!=1 & h1nm1!=7 & h1pf1==7
(22 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
          5 No mother figure identified |         29        0.45       92.36
                                      . |        497        7.64      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. * 3 Resident nonbiological mothers
. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace momtype1=4 if momtype1==. & h1hr3`x'==14 & h1hr6`x'>=8 & h1hr6`x'!=97
  3. }
(92 real changes made)
(98 real changes made)
(17 real changes made)
(9 real changes made)
(10 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        227        3.49       95.40
          5 No mother figure identified |         29        0.45       95.85
                                      . |        270        4.15      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know biological mother's education, use resident mother's.
. replace momtype1=4 if momtype1==. & h1nm4>=11 & h1nm4!=97 & h1rm1<=9
(10 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        313        4.81       91.91
4 Resident mother serves as mother figu |        237        3.64       95.56
          5 No mother figure identified |         29        0.45       96.00
                                      . |        260        4.00      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know nonbiores mother's education, use biomom's
. replace momtype1=2 if momtype1==. & h1rm1>=11 & h1rm1!=97 & h1nm4<=9
(26 real changes made)

. tab momtype1, m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        339        5.21       92.31
4 Resident mother serves as mother figu |        237        3.64       95.96
          5 No mother figure identified |         29        0.45       96.40
                                      . |        234        3.60      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If information available on both biological and resident mother's educations, use higher value
. tab h1nm4 h1rm1, m

S12Q4 EDUCATION LEVEL |                 S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 |         0  8th grade  >8th grad  Business/  High scho        GED |     Total
----------------------+------------------------------------------------------------------+----------
    8th grade or less |         0          6          2          1          5          0 |        43 
>8th grade/didn't gra |         0          8         16          0         22          2 |       114 
Business/trade/voc. s |         0          0          0          0          0          0 |         6 
 High school graduate |         1          8         12          0         56          5 |       232 
                  GED |         0          2          3          0          8          1 |        38 
Business/trade/voc. s |         0          1          3          0          5          0 |        41 
College/didn't gradua |         0          1          1          0         10          0 |        76 
Graduated from colleg |         0          0          3          0          6          0 |        87 
Prof training beyond  |         0          0          0          0          1          0 |        27 
Went to school/Resp d |         0          3          2          0          7          0 |        33 
Resp doesn't know if  |         0          0          1          0          3          0 |        30 
              Refused |         0          0          0          0          0          0 |         3 
      Legitimate skip |         6        234        524         40      1,688        209 |     5,764 
           Don't know |         0          0          1          0          0          0 |        10 
----------------------+------------------------------------------------------------------+----------
                Total |         7        263        568         41      1,811        217 |     6,504 


S12Q4 EDUCATION LEVEL |                 S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 | Business/  College/d  Graduated  Prof trai  Went to s  Resp does |     Total
----------------------+------------------------------------------------------------------+----------
    8th grade or less |         0          2          1          0          2          3 |        43 
>8th grade/didn't gra |         1          1          2          1          3          1 |       114 
Business/trade/voc. s |         0          1          0          0          0          0 |         6 
 High school graduate |        10         13         17          3          6          3 |       232 
                  GED |         1          0          0          1          3          0 |        38 
Business/trade/voc. s |         5          2          2          1          3          2 |        41 
College/didn't gradua |         2          8          7          6          3          1 |        76 
Graduated from colleg |         2          5         14          7          4          1 |        87 
Prof training beyond  |         1          0          3          4          0          0 |        27 
Went to school/Resp d |         1          2          1          1          4          0 |        33 
Resp doesn't know if  |         0          2          6          2          2          4 |        30 
              Refused |         0          1          0          0          0          0 |         3 
      Legitimate skip |       402        731      1,188        486        149         27 |     5,764 
           Don't know |         1          2          0          0          0          0 |        10 
----------------------+------------------------------------------------------------------+----------
                Total |       426        770      1,241        512        179         42 |     6,504 


S12Q4 EDUCATION LEVEL | S14Q1 RES MOM-EDUCATION LEVEL-W1
        OF BIO MOM-W1 |   Refused  Legitimat  Don't kno |     Total
----------------------+---------------------------------+----------
    8th grade or less |         0         21          0 |        43 
>8th grade/didn't gra |         0         56          1 |       114 
Business/trade/voc. s |         0          5          0 |         6 
 High school graduate |         0         96          2 |       232 
                  GED |         0         19          0 |        38 
Business/trade/voc. s |         0         17          0 |        41 
College/didn't gradua |         0         37          0 |        76 
Graduated from colleg |         0         44          1 |        87 
Prof training beyond  |         0         18          0 |        27 
Went to school/Resp d |         0         12          0 |        33 
Resp doesn't know if  |         0         10          0 |        30 
              Refused |         0          2          0 |         3 
      Legitimate skip |         4         29         47 |     5,764 
           Don't know |         0          4          2 |        10 
----------------------+---------------------------------+----------
                Total |         4        370         53 |     6,504 


. replace momtype1=2 if momtype1==. & h1nm4>=h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(120 real changes made)

. replace momtype1=4 if momtype1==. & h1nm4<h1rm1 & h1nm4<=9 & h1rm1<=9 & h1nm1!=7
(60 real changes made)

. 
. tab momtype1, m /*54 missing cases*/

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |      5,665       87.10       87.10
2 Biological-nonresident mother (no res |        459        7.06       94.16
4 Resident mother serves as mother figu |        297        4.57       98.72
          5 No mother figure identified |         29        0.45       99.17
                                      . |         54        0.83      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. // Apply dad code and see for how many both missing.
. *Coding for dadtype1
. gen dadtype1=.
(6504 missing values generated)

. label define dad 1 "1 Biological father is resident father" 2 "2 Biological-nonresident father (no 
> resident father)" 3 "3 Biological nonresident father and/or resident nonbiological father (Placehol
> der)" 4 "4 Resident father serves as father (no biological father)" 5 "5 No father figure identifie
> d"

. label values dadtype1 dad

. label var dadtype1 "Description of father whose SEP being measured in W1"

. 
. *Biological resident
. replace dadtype1=1 if h1nf1==7
(3766 real changes made)

. 
. *Information on how many nonres biol fathers years of schooling where there is also no resident fat
> her?
. *tab h1nf4 if h1nf4!=97, m
. replace dadtype1=2 if h1nf4<=9 & h1hr12==0
(79 real changes made)

. replace dadtype1=2 if h1nf4<=9 & h1pf23==7
(1338 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
                                      . |      1,321       20.31      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *No resident father figure nor biological nonresident father identified
. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1hr12==0
(20 real changes made)

. replace dadtype1=5 if dadtype1==. & h1nf1!=1 & h1nf1!=7 & h1pf23==7
(291 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
          5 No father figure identified |        311        4.78       84.47
                                      . |      1,010       15.53      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *Resident nonbiological fathers
. foreach x in a b c d e f g h i j k l m n o p q r s t{
  2. replace dadtype1=4 if dadtype1==. & h1hr3`x'==11 & h1hr6`x'>=2 & h1hr6`x'<=6
  3. }
(167 real changes made)
(346 real changes made)
(66 real changes made)
(34 real changes made)
(16 real changes made)
(4 real changes made)
(6 real changes made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        642        9.87       89.56
          5 No father figure identified |        311        4.78       94.34
                                      . |        368        5.66      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know biological father's education, use resident father's.
. replace dadtype1=4 if dadtype1==. & h1nf4>=11 & h1nf4!=97 &  h1rf1<=9
(11 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,417       21.79       79.69
4 Resident father serves as father (no  |        653       10.04       89.73
          5 No father figure identified |        311        4.78       94.51
                                      . |        357        5.49      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If don't know resident father's education, use biological father's
. replace dadtype1=2 if dadtype1==. & h1nf4<=9 & h1rf1>=9 & h1rf1!=97 
(14 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,431       22.00       79.90
4 Resident father serves as father (no  |        653       10.04       89.94
          5 No father figure identified |        311        4.78       94.73
                                      . |        343        5.27      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. 
. *If information on both biological and resident father's educations, use higher value
. replace dadtype1=2 if dadtype1==. & h1nf4>=h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(52 real changes made)

. replace dadtype1=4 if dadtype1==. & h1nf4<h1rf1 & h1nf4<=9 & h1rf1<=9 & h1nf1!=7
(17 real changes made)

. tab dadtype1, m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 1 Biological father is resident father |      3,766       57.90       57.90
2 Biological-nonresident father (no res |      1,483       22.80       80.70
4 Resident father serves as father (no  |        670       10.30       91.01
          5 No father figure identified |        311        4.78       95.79
                                      . |        274        4.21      100.00
----------------------------------------+-----------------------------------
                                  Total |      6,504      100.00

. *274 missing
. 
. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195        174         21         32         37 |       459 
4 Resident mother ser |       128         48         78         24         19 |       297 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        670        311        274 |     6,504 


. *19 mutual missing
. *174 indicate living with neither biomother nor biofather
. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

   S11Q12 WHO ACTS AS |              S11Q13 WHO ACTS AS THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  2nd house  3rd house  4th house  Legitimat |     Total
----------------------+------------------------------------------------------------------+----------
               No one |        71          3          0          0          0          0 |        74 
 1st household member |        36          7         21          4          0          0 |        68 
 2nd household member |         3         12          1          1          0          0 |        17 
 3rd household member |         3          0          1          0          1          0 |         5 
 4th household member |         1          0          0          0          0          0 |         1 
Legitimate skip (list |         0          0          0          0          0          9 |         9 
----------------------+------------------------------------------------------------------+----------
                Total |       114         22         23          5          1          9 |       174 


. replace momtype1=4 if momtype1==2 & dadtype1==2 & h1hr12>=1 & h1hr12<=8
(91 real changes made)

. 
. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         83         21         32         37 |       368 
4 Resident mother ser |       128        139         78         24         19 |       388 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,483        670        311        274 |     6,504 


. *83 cases where indicate living with neither biomother nor biofather
. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

                      | S11Q13 WHO ACTS AS THE FATHER TO
   S11Q12 WHO ACTS AS |              YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  Legitimat |     Total
----------------------+---------------------------------+----------
               No one |        71          3          0 |        74 
Legitimate skip (list |         0          0          9 |         9 
----------------------+---------------------------------+----------
                Total |        71          3          9 |        83 


. replace dadtype1=4 if momtype1==2 & dadtype1==2 & h1hr13>=1 & h1hr13<=6
(3 real changes made)

. 
. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         80         24         32         37 |       368 
4 Resident mother ser |       128        139         78         24         19 |       388 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4         19 |        54 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,480        673        311        274 |     6,504 


. tab h1hr12 h1hr13 if momtype1==2 & dadtype1==2, m

                      |  S11Q13 WHO ACTS AS
   S11Q12 WHO ACTS AS | THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  Legitimat |     Total
----------------------+----------------------+----------
               No one |        71          0 |        71 
Legitimate skip (list |         0          9 |         9 
----------------------+----------------------+----------
                Total |        71          9 |        80 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 if momtype==2 & dadtype1==2, m

S11Q12 WHO ACTS AS THE MOTHER TO YOU-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                 No one |         71       88.75       88.75
Legitimate skip (listed a father/mother |          9       11.25      100.00
----------------------------------------+-----------------------------------
                                  Total |         80      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr13 if momtype1==2 & dadtype1==2, m 

S11Q13 WHO ACTS AS THE FATHER TO YOU-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                 No one |         71       88.75       88.75
Legitimate skip (listed a father/mother |          9       11.25      100.00
----------------------------------------+-----------------------------------
                                  Total |         80      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=4 if momtype1==2 & dadtype1==2 & h1hr12==97
(9 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1hr12 h1hr13 if momtype1==. & dadtype1==.

   S11Q12 WHO ACTS AS |        S11Q13 WHO ACTS AS THE FATHER TO YOU-W1
 THE MOTHER TO YOU-W1 |    No one  1st house  2nd house  4th house  Don't kno |     Total
----------------------+-------------------------------------------------------+----------
               No one |         4          0          0          0          0 |         4 
 1st household member |         2          3          4          1          0 |        10 
 2nd household member |         0          2          0          0          0 |         2 
 3rd household member |         1          1          0          0          0 |         2 
           Don't know |         0          0          0          0          1 |         1 
----------------------+-------------------------------------------------------+----------
                Total |         7          6          4          1          1 |        19 


. replace momtype1=4 if momtype1==. & dadtype1==. & h1hr12>=1 & h1hr12<=8
(14 real changes made)

. replace dadtype1=4 if momtype1==. & dadtype1==. & h1hr13>=1 & h1hr13<=6
(0 real changes made)

. replace dadtype1=4 if dadtype1==. & h1hr13>=1 & h1hr13<=8
(44 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 dadtype1, m /*Down to 5 mutual missing*/

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         71         44         32         17 |       359 
4 Resident mother ser |       128        148        102         24          9 |       411 
5 No mother figure id |        10          3          0         16          0 |        29 
                    . |        21          7          3          4          5 |        40 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,480        717        311        230 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace momtype1=5 if momtype1==. & dadtype1==.
(5 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 dadtype1, m

Description of mother |
      whose SEP being |  Description of father whose SEP being measured in W1
   measured in Wave 1 | 1 Biologi  2 Biologi  4 Residen  5 No fath          . |     Total
----------------------+-------------------------------------------------------+----------
1 Biological resident |     3,412      1,251        568        235        199 |     5,665 
2 Biological-nonresid |       195         71         44         32         17 |       359 
4 Resident mother ser |       128        148        102         24          9 |       411 
5 No mother figure id |        10          3          0         16          5 |        34 
                    . |        21          7          3          4          0 |        35 
----------------------+-------------------------------------------------------+----------
                Total |     3,766      1,480        717        311        230 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. **Dummy variables for momtypes, Wave 1
. gen bioresmom1=(momtype1==1)

. label var bioresmom1 "Biological resident mother at Wave 1"

. label values bioresmom1 binary

. gen biononresmom1=(momtype1==2)

. label var biononresmom1 "Biological nonresident  mother at Wave 1"

. label values biononresmom1 binary

. gen nonbioresmom1=(momtype1==4)

. label var nonbioresmom1 "Non biological resident mother at Wave 1"

. label values nonbioresmom1 binary

. gen nomom1=(momtype1==5)

. label var nomom1 "No mother figure reported/known at Wave 1"

. label values nomom1 binary

. 
. *Dummy variables for dadtype Wave 1
. gen bioresdad1=(dadtype1==1)

. label var bioresdad1 "Biological resident father at Wave 1"

. label values bioresdad1 binary

. gen biononresdad1=(dadtype1==2)

. label var biononresdad1 "Biological nonresident  father at Wave 1"

. label values biononresdad1 binary

. gen nonbioresdad1=(dadtype1==4)

. label var nonbioresdad1 "Non biological resident father at Wave 1"

. label values nonbioresdad1 binary

. gen nodad1=(dadtype1==5)

. label var "No father figure reported/known at Wave 1"
"No father figure reported/known at Wave 1 invalid name
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label var nodad1 "No father figure reported/known at Wave 1"

. label values nodad1 binary

. 
. 
. *Family type
. /*Look at King's cited papers for guidance on how to consolidate these categories*/
. gen famtype1=.
(6504 missing values generated)

. label var famtype1 "Family-Household Composition at Wave 1"

. label define family 1 "1 Lives with both bioparents" 2 "2 Lives with one bioparent" 3 "3 Lives w/on
> e bioparent and nonbiores parent"  4 "4 Lives with two nonbiological parents" 5 "5 Other or unknown
>  living arrangement" 

. label values famtype1 family

. 
. replace famtype1=1 if momtype1==1 & dadtype1==1
(3412 real changes made)

. 
. replace famtype1=2 if momtype1==1 & dadtype1==.
(199 real changes made)

. replace famtype1=2 if dadtype1==1 & momtype1==.
(21 real changes made)

. replace famtype1=2 if momtype1==1 & dadtype1==5
(235 real changes made)

. replace famtype1=2 if dadtype1==1 & momtype1==5
(10 real changes made)

. 
. replace famtype1=2 if momtype1==1 & dadtype1==2
(1251 real changes made)

. replace famtype1=2 if dadtype1==1 & momtype1==2
(195 real changes made)

. 
. replace famtype1=3 if momtype1==1 & dadtype1==4
(568 real changes made)

. replace famtype1=3 if momtype1==4 & dadtype1==1
(128 real changes made)

. 
. replace famtype1=4 if momtype1==4 & dadtype1==4
(102 real changes made)

. 
. replace famtype1=5 if momtype1==4 & dadtype1==.
(9 real changes made)

. replace famtype1=5 if dadtype1==4 & momtype1==.
(3 real changes made)

. replace famtype1=5 if momtype1==4 & dadtype1==2
(148 real changes made)

. replace famtype1=5 if momtype1==2 & dadtype1==4
(44 real changes made)

. 
. replace famtype1=5 if momtype1==2 & dadtype1==2
(71 real changes made)

. replace famtype1=5 if momtype1==. & dadtype1==.
(0 real changes made)

. replace famtype1=5 if momtype1==2 & dadtype1==.
(17 real changes made)

. replace famtype1=5 if momtype1==. & dadtype1==2
(7 real changes made)

. 
. tab momtype1 famtype1, m

Description of mother |
      whose SEP being |              Family-Household Composition at Wave 1
   measured in Wave 1 | 1 Lives w  2 Lives w  3 Lives w  4 Lives w  5 Other o          . |     Total
----------------------+------------------------------------------------------------------+----------
1 Biological resident |     3,412      1,685        568          0          0          0 |     5,665 
2 Biological-nonresid |         0        195          0          0        132         32 |       359 
4 Resident mother ser |         0          0        128        102        157         24 |       411 
5 No mother figure id |         0         10          0          0          0         24 |        34 
                    . |         0         21          0          0         10          4 |        35 
----------------------+------------------------------------------------------------------+----------
                Total |     3,412      1,911        696        102        299         84 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab dadtype1 if momtype1==4 & famtype1==., m

  Description of father whose SEP being |
                         measured in W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
          5 No father figure identified |         24      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |         24      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace famtype1=5 if famtype1==. & momtype1==4 & dadtype1==5
(24 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab dadtype1 famtype1, m

Description of father |
      whose SEP being |              Family-Household Composition at Wave 1
       measured in W1 | 1 Lives w  2 Lives w  3 Lives w  4 Lives w  5 Other o          . |     Total
----------------------+------------------------------------------------------------------+----------
1 Biological father i |     3,412        226        128          0          0          0 |     3,766 
2 Biological-nonresid |         0      1,251          0          0        226          3 |     1,480 
4 Resident father ser |         0          0        568        102         47          0 |       717 
5 No father figure id |         0        235          0          0         24         52 |       311 
                    . |         0        199          0          0         26          5 |       230 
----------------------+------------------------------------------------------------------+----------
                Total |     3,412      1,911        696        102        323         60 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen twobiorespar1=(famtype1==1)

. label var twobiorespar1 "Lives with both bioparents at Wave 1"

. label values twobiorespar1 binary

. gen oneresbiopar1=(famtype1==2)

. label values onebiorespar1 binary
variable onebiorespar1 not found
r(111);

end of do-file

r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen onebiorepar1=(famtype1==2)

. label values onebiorespar1 binary
variable onebiorespar1 not found
r(111);

end of do-file

r(111);

. drop oneresbiopar onebiorespar
variable onebiorespar not found
r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen onebiorespar1=(famtype1==2)

. label values onebiorespar1 binary

. label var onerbiorespar1 "Lives with one bioparent at Wave 1"
variable onerbiorespar1 not found
r(111);

end of do-file

r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. label var onebiorespar1 "Lives with one bioparent at Wave 1"

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen bioblended=(famtype1==3)

. label var bioblended "Lives with one bioparent and one non-bio parent at Wave 1"

. label values famtype4_1 binary
variable famtype4_1 not found
r(111);

end of do-file

r(111);

. drop bioblended1
variable bioblended1 not found
r(111);

. drop bioblended

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen bioblended1=(famtype1==3)

. label var bioblended1 "Lives with one bioparent and one non-bio parent at Wave 1"

. label values bioblended1 binary

. gen twononbiorespar1=(famtype1==4)

. label var twononbiorespar1 "Lives with two non-biological parents at Wave 1"

. label values twononbiorespar1 binary

. gen fam_other1=(famtype1==5)

. label var fam_other1 "Other or unknown living arrangement at Wave 1"

. label values fam_other1 binary 

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. * Mother's education, Wave 1
. gen mothered1=.
(6504 missing values generated)

. label var mothered1 "Mother's years of schooling at Wave 1"

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered1=0 if momtype1==1 & h1rm1==10
(0 real changes made)

. replace mothered1=8 if momtype1==1 & h1rm1==1
(230 real changes made)

. replace mothered1=10 if momtype1==1 & h1rm1==2
(520 real changes made)

. replace mothered1=12 if momtype1==1 & h1rm1>=3 & h1rm1<=5
(1917 real changes made)

. replace mothered1=14 if momtype1==1 & h1rm1>=6 & h1rm1<=7
(1122 real changes made)

. replace mothered1=16 if momtype1==1 & h1rm1==8
(1173 real changes made)

. replace mothered1=18 if momtype1==1 & h1rm1==9
(478 real changes made)

. 
. * Biological mother's education not measured in Wave II, so code as same
. * Introduces bias/threat to validity - Goodman paper
. gen mothered2=.
(6504 missing values generated)

. label var mothered2 "Mother's years of schooling at Wave 2"

. 
. replace mothered1=8 if momtype1==2 & h1nm4==1
(24 real changes made)

. replace mothered1=10 if momtype1==2 & h1nm4==2
(68 real changes made)

. replace mothered1=12 if momtype1==2 & h1nm4>=3 & h1nm4<=5
(143 real changes made)

. replace mothered1=14 if momtype1==2 & h1nm4>=6 & h1nm4<=7
(59 real changes made)

. replace mothered1=16 if momtype1==2 & h1nm4==8
(48 real changes made)

. replace mothered1=18 if momtype1==2 & h1nm4==9
(17 real changes made)

. 
. replace mothered2=mothered1 if momtype1<=2
(5799 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered1=0 if momtype1==4 & h1rm1==10
(0 real changes made)

. replace mothered1=8 if momtype1==4 & h1rm1==1
(21 real changes made)

. replace mothered1=10 if momtype1==4 & h1rm1==2
(30 real changes made)

. replace mothered1=12 if momtype1==4 & h1rm1>=3 & h1rm1<=5
(135 real changes made)

. replace mothered1=14 if momtype1==4 & h1rm1>=6 & h1rm1<=7
(71 real changes made)

. replace mothered1=16 if momtype1==4 & h1rm1==8
(66 real changes made)

. replace mothered1=18 if momtype1==4 & h1rm1==9
(34 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h2rm1 if momtype1==4, m

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.24        0.24
                      8th grade or less |          6        1.46        1.70
 >8th grade/didn't graduate high school |         22        5.35        7.06
Business/trade/voc school instead high  |          1        0.24        7.30
                   High school graduate |         65       15.82       23.11
                                    GED |          3        0.73       23.84
Business/trade/voc school after high sc |         14        3.41       27.25
                College/didn't graduate |         22        5.35       32.60
      Graduated from college/university |         45       10.95       43.55
Prof training beyond 4-year college/uni |         22        5.35       48.91
 Went to school/Resp doesn't know level |         12        2.92       51.82
Resp doesn't know if she went to school |          7        1.70       53.53
               Legitimate skip (no MOM) |         75       18.25       71.78
                                      . |        116       28.22      100.00
----------------------------------------+-----------------------------------
                                  Total |        411      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h2rm1 if momtype1==4 & mothered1==0, m
no observations

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered2=8 if momtype1==4 & mothered1==8 & h2rm1==1
(3 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered2=10 if momtype1==4 & mothered1<=10 & h2rm1==2
(12 real changes made)

. replace mothered2=12 if momtype1==4 & mothered1>=10 & mothered1<=12 & h2rm1>=3 & h2rm1<=5
(48 real changes made)

. replace mothered2=14 if momtype1==4 & mothered1<=12 & mothered1<=14 & h2rm1>=6 & h2rm1<=7
(9 real changes made)

. replace mothered2=16 if momtype1==4 & mothered1>=14 & mothered1<=16 & h2rm1==8
(28 real changes made)

. replace mothered2=18 if momtype1==4 & mothered1>=16 & h2rm1==9
(21 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h2rm1 if mothered2==.

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        0.27        0.27
                      8th grade or less |          4        1.06        1.33
 >8th grade/didn't graduate high school |         13        3.46        4.79
Business/trade/voc school instead high  |          1        0.27        5.05
                   High school graduate |         20        5.32       10.37
                                    GED |          4        1.06       11.44
Business/trade/voc school after high sc |         10        2.66       14.10
                College/didn't graduate |         19        5.05       19.15
      Graduated from college/university |         20        5.32       24.47
Prof training beyond 4-year college/uni |          3        0.80       25.27
 Went to school/Resp doesn't know level |         15        3.99       29.26
Resp doesn't know if she went to school |          8        2.13       31.38
               Legitimate skip (no MOM) |        258       68.62      100.00
----------------------------------------+-----------------------------------
                                  Total |        376      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab mothered1 h2rm1 if mothered2==.

  Mother's |
  years of |
 schooling |                       S14Q1 RES MOM-EDUCATION LEVEL-W2
 at Wave 1 |         0  8th grade  >8th grad  Business/  High scho        GED  Business/ |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |         1          0          0          0          0          0          0 |         9 
        10 |         0          1          0          0          0          0          0 |        11 
        12 |         0          0          8          0          0          0          0 |        41 
        14 |         0          0          0          1          7          2          8 |        48 
        16 |         0          0          0          0          6          0          2 |        22 
        18 |         0          0          0          0          1          0          0 |        13 
-----------+-----------------------------------------------------------------------------+----------
     Total |         1          1          8          1         14          2         10 |       144 


  Mother's |
  years of |
 schooling |                 S14Q1 RES MOM-EDUCATION LEVEL-W2
 at Wave 1 | College/d  Graduated  Prof trai  Went to s  Resp does  Legitimat |     Total
-----------+------------------------------------------------------------------+----------
         8 |         0          0          0          1          1          6 |         9 
        10 |         0          2          0          1          1          6 |        11 
        12 |         0          7          0          1          2         23 |        41 
        14 |        12          0          1          3          0         14 |        48 
        16 |         3          0          0          2          1          8 |        22 
        18 |         2          7          0          0          0          3 |        13 
-----------+------------------------------------------------------------------+----------
     Total |        17         16          1          8          5         60 |       144 


.  h2rm1==0
unrecognized command:  h2rm1
r(199);

end of do-file

r(199);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered2=8 if mothered2=. & h2rm1==0
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered2=8 if mothered2==. & h2rm1==0
(1 real change made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered2=mothered1 if mothered1!=. & mothered2==.
(236 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered1=mothered2 if mothered1==. & mothered2!=.
(1 real change made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab mothered1 mothered2, m

  Mother's |
  years of |
 schooling |                    Mother's years of schooling at Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       274          1          0          0          0          0          0 |       275 
        10 |         0        616          1          1          0          0          0 |       618 
        12 |         0          0      2,187          8          0          0          0 |     2,195 
        14 |         0          0          0      1,247          5          0          0 |     1,252 
        16 |         0          0          0          0      1,281          6          0 |     1,287 
        18 |         0          0          0          0          0        530          0 |       530 
         . |         0          0          0          0          0          0        347 |       347 
-----------+-----------------------------------------------------------------------------+----------
     Total |       274        617      2,188      1,256      1,286        536        347 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 if mothered1==. & mothered2==.

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |        225       72.12       72.12
4 Resident mother serves as mother figu |         53       16.99       89.10
          5 No mother figure identified |         34       10.90      100.00
----------------------------------------+-----------------------------------
                                  Total |        312      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==1 & mothered1==.

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          6        2.67        2.67
 Went to school/Resp doesn't know level |        145       64.44       67.11
Resp doesn't know if she went to school |         27       12.00       79.11
                                Refused |          3        1.33       80.44
                             Don't know |         44       19.56      100.00
----------------------------------------+-----------------------------------
                                  Total |        225      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h2rm1 if momtype1==1 & mothered1==.

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
 >8th grade/didn't graduate high school |          1        0.63        0.63
                   High school graduate |          1        0.63        1.27
                College/didn't graduate |          1        0.63        1.90
               Legitimate skip (no MOM) |        155       98.10      100.00
----------------------------------------+-----------------------------------
                                  Total |        158      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==4 & mothered1==.

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        1.89        1.89
 Went to school/Resp doesn't know level |         27       50.94       52.83
Resp doesn't know if she went to school |          9       16.98       69.81
               Legitimate skip (no MOM) |          9       16.98       86.79
                             Don't know |          7       13.21      100.00
----------------------------------------+-----------------------------------
                                  Total |         53      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 if mothered1==. & mothered2==., m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |        225       64.84       64.84
4 Resident mother serves as mother figu |         53       15.27       80.12
          5 No mother figure identified |         34        9.80       89.91
                                      . |         35       10.09      100.00
----------------------------------------+-----------------------------------
                                  Total |        347      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==1 & mothered1==., m

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          6        2.67        2.67
 Went to school/Resp doesn't know level |        145       64.44       67.11
Resp doesn't know if she went to school |         27       12.00       79.11
                                Refused |          3        1.33       80.44
                             Don't know |         44       19.56      100.00
----------------------------------------+-----------------------------------
                                  Total |        225      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==4 & mothered1==., m

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        1.89        1.89
 Went to school/Resp doesn't know level |         27       50.94       52.83
Resp doesn't know if she went to school |          9       16.98       69.81
               Legitimate skip (no MOM) |          9       16.98       86.79
                             Don't know |          7       13.21      100.00
----------------------------------------+-----------------------------------
                                  Total |         53      100.00

. 
end of do-file

. drop mothered1

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen mothered1=.
(6504 missing values generated)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace mothered1=0 if momtype1==1 & h1rm1==0
(6 real changes made)

. replace mothered1=8 if momtype1==1 & h1rm1==1
(230 real changes made)

. replace mothered1=10 if momtype1==1 & h1rm1==2
(520 real changes made)

. replace mothered1=12 if momtype1==1 & h1rm1>=3 & h1rm1<=5
(1917 real changes made)

. replace mothered1=14 if momtype1==1 & h1rm1>=6 & h1rm1<=7
(1122 real changes made)

. replace mothered1=16 if momtype1==1 & h1rm1==8
(1173 real changes made)

. replace mothered1=18 if momtype1==1 & h1rm1==9
(478 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen mothered2=.
mothered2 already defined
r(110);

end of do-file

r(110);

. drop mothered2

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen mothered2=.
(6504 missing values generated)

. label var mothered2 "Mother's years of schooling at Wave 2"

. 
. replace mothered1=8 if momtype1==2 & h1nm4==1
(24 real changes made)

. replace mothered1=10 if momtype1==2 & h1nm4==2
(68 real changes made)

. replace mothered1=12 if momtype1==2 & h1nm4>=3 & h1nm4<=5
(143 real changes made)

. replace mothered1=14 if momtype1==2 & h1nm4>=6 & h1nm4<=7
(59 real changes made)

. replace mothered1=16 if momtype1==2 & h1nm4==8
(48 real changes made)

. replace mothered1=18 if momtype1==2 & h1nm4==9
(17 real changes made)

. 
. replace mothered2=mothered1 if momtype1<=2
(5805 real changes made)

. 
. * Resident mother only
. replace mothered1=0 if momtype1==4 & h1rm1==0
(1 real change made)

. replace mothered1=8 if momtype1==4 & h1rm1==1
(21 real changes made)

. replace mothered1=10 if momtype1==4 & h1rm1==2
(30 real changes made)

. replace mothered1=12 if momtype1==4 & h1rm1>=3 & h1rm1<=5
(135 real changes made)

. replace mothered1=14 if momtype1==4 & h1rm1>=6 & h1rm1<=7
(71 real changes made)

. replace mothered1=16 if momtype1==4 & h1rm1==8
(66 real changes made)

. replace mothered1=18 if momtype1==4 & h1rm1==9
(34 real changes made)

. 
. *Resident mother only, Wave 2
. tab h2rm1 if momtype1==4 & mothered1==0, m

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      . |          1      100.00      100.00
----------------------------------------+-----------------------------------
                                  Total |          1      100.00

. 
end of do-file

. drop mothered1 mothered2

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen mothered1=.
(6504 missing values generated)

. label var mothered1 "Mother's years of schooling at Wave 1"

. 
. replace mothered1=8 if momtype1==1 & h1rm1==1
(230 real changes made)

. replace mothered1=10 if momtype1==1 & h1rm1==2
(520 real changes made)

. replace mothered1=12 if momtype1==1 & h1rm1>=3 & h1rm1<=5
(1917 real changes made)

. replace mothered1=14 if momtype1==1 & h1rm1>=6 & h1rm1<=7
(1122 real changes made)

. replace mothered1=16 if momtype1==1 & h1rm1==8
(1173 real changes made)

. replace mothered1=18 if momtype1==1 & h1rm1==9
(478 real changes made)

. 
. * Biological mother's education not measured in Wave II, so code as same
. * Introduces bias/threat to validity - Goodman paper
. gen mothered2=.
(6504 missing values generated)

. label var mothered2 "Mother's years of schooling at Wave 2"

. 
. replace mothered1=8 if momtype1==2 & h1nm4==1
(24 real changes made)

. replace mothered1=10 if momtype1==2 & h1nm4==2
(68 real changes made)

. replace mothered1=12 if momtype1==2 & h1nm4>=3 & h1nm4<=5
(143 real changes made)

. replace mothered1=14 if momtype1==2 & h1nm4>=6 & h1nm4<=7
(59 real changes made)

. replace mothered1=16 if momtype1==2 & h1nm4==8
(48 real changes made)

. replace mothered1=18 if momtype1==2 & h1nm4==9
(17 real changes made)

. 
. replace mothered2=mothered1 if momtype1<=2
(5799 real changes made)

. 
. * Resident mother only
. replace mothered1=8 if momtype1==4 & h1rm1==1
(21 real changes made)

. replace mothered1=10 if momtype1==4 & h1rm1==2
(30 real changes made)

. replace mothered1=12 if momtype1==4 & h1rm1>=3 & h1rm1<=5
(135 real changes made)

. replace mothered1=14 if momtype1==4 & h1rm1>=6 & h1rm1<=7
(71 real changes made)

. replace mothered1=16 if momtype1==4 & h1rm1==8
(66 real changes made)

. replace mothered1=18 if momtype1==4 & h1rm1==9
(34 real changes made)

. 
. *Resident mother only, Wave 2
. *No obseverations
. replace mothered2=8 if momtype1==4 & mothered1==8 & h2rm1==1
(3 real changes made)

. replace mothered2=10 if momtype1==4 & mothered1<=10 & h2rm1==2
(12 real changes made)

. replace mothered2=12 if momtype1==4 & mothered1>=10 & mothered1<=12 & h2rm1>=3 & h2rm1<=5
(48 real changes made)

. replace mothered2=14 if momtype1==4 & mothered1<=12 & mothered1<=14 & h2rm1>=6 & h2rm1<=7
(9 real changes made)

. replace mothered2=16 if momtype1==4 & mothered1>=14 & mothered1<=16 & h2rm1==8
(28 real changes made)

. replace mothered2=18 if momtype1==4 & mothered1>=16 & h2rm1==9
(21 real changes made)

. 
. *tab mothered1 h2rm1 if mothered2==.
. replace mothered2=mothered1 if mothered1!=. & mothered2==.
(237 real changes made)

. replace mothered1=mothered2 if mothered1==. & mothered2!=.
(1 real change made)

. 
. tab mothered1 mothered2, m

  Mother's |
  years of |
 schooling |                    Mother's years of schooling at Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       274          1          0          0          0          0          0 |       275 
        10 |         0        616          1          1          0          0          0 |       618 
        12 |         0          0      2,187          8          0          0          0 |     2,195 
        14 |         0          0          0      1,247          5          0          0 |     1,252 
        16 |         0          0          0          0      1,281          6          0 |     1,287 
        18 |         0          0          0          0          0        530          0 |       530 
         . |         0          0          0          0          0          0        347 |       347 
-----------+-----------------------------------------------------------------------------+----------
     Total |       274        617      2,188      1,256      1,286        536        347 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab momtype1 if mothered1==. & mothered2==., m

  Description of mother whose SEP being |
                     measured in Wave 1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
           1 Biological resident mother |        225       64.84       64.84
4 Resident mother serves as mother figu |         53       15.27       80.12
          5 No mother figure identified |         34        9.80       89.91
                                      . |         35       10.09      100.00
----------------------------------------+-----------------------------------
                                  Total |        347      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==1 & mothered1==., m

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          6        2.67        2.67
 Went to school/Resp doesn't know level |        145       64.44       67.11
Resp doesn't know if she went to school |         27       12.00       79.11
                                Refused |          3        1.33       80.44
                             Don't know |         44       19.56      100.00
----------------------------------------+-----------------------------------
                                  Total |        225      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==4 & mothered1==., m

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        1.89        1.89
 Went to school/Resp doesn't know level |         27       50.94       52.83
Resp doesn't know if she went to school |          9       16.98       69.81
               Legitimate skip (no MOM) |          9       16.98       86.79
                             Don't know |          7       13.21      100.00
----------------------------------------+-----------------------------------
                                  Total |         53      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==1 & mothered1==. & mothered2==., m

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          6        2.67        2.67
 Went to school/Resp doesn't know level |        145       64.44       67.11
Resp doesn't know if she went to school |         27       12.00       79.11
                                Refused |          3        1.33       80.44
                             Don't know |         44       19.56      100.00
----------------------------------------+-----------------------------------
                                  Total |        225      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h1rm1 if momtype1==4 & mothered1==. & mothered2==., m

       S14Q1 RES MOM-EDUCATION LEVEL-W1 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |          1        1.89        1.89
 Went to school/Resp doesn't know level |         27       50.94       52.83
Resp doesn't know if she went to school |          9       16.98       69.81
               Legitimate skip (no MOM) |          9       16.98       86.79
                             Don't know |          7       13.21      100.00
----------------------------------------+-----------------------------------
                                  Total |         53      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h2rm1 if momtype==4 & mothered1==. & mothered2==. m
invalid 'm' 
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab h2rm1 if momtype==4 & mothered1==. & mothered2==. , m

       S14Q1 RES MOM-EDUCATION LEVEL-W2 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                      8th grade or less |          2        3.77        3.77
 >8th grade/didn't graduate high school |          2        3.77        7.55
                   High school graduate |          4        7.55       15.09
      Graduated from college/university |          1        1.89       16.98
 Went to school/Resp doesn't know level |          4        7.55       24.53
Resp doesn't know if she went to school |          2        3.77       28.30
               Legitimate skip (no MOM) |         15       28.30       56.60
                                      . |         23       43.40      100.00
----------------------------------------+-----------------------------------
                                  Total |         53      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen fathered1=.
(6504 missing values generated)

. label var fathered1 "Father's years of schooling at Wave 1"

. 
. * Biological Resident Father
. replace fathered1=8 if dadtype1==1 & h1rf1==1
(187 real changes made)

. replace fathered1=10 if dadtype1==1 & h1rf1==2
(314 real changes made)

. replace fathered1=12 if dadtype1==1 & h1rf1>=3 & h1rf1<=5
(1188 real changes made)

. replace fathered1=14 if dadtype1==1 & h1rf1>=6 & h1rf1<=7
(650 real changes made)

. replace fathered1=16 if dadtype1==1 & h1rf1==8
(786 real changes made)

. replace fathered1=18 if dadtype1==1 & h1rf1==9
(473 real changes made)

. 
. *Biological nonresident dad
. replace fathered1=8 if dadtype1==1 & h1nf4==1
(0 real changes made)

. replace fathered1=10 if dadtype1==1 & h1nf4==2
(0 real changes made)

. replace fathered1=12 if dadtype1==2 & h1nf4>=3 & h1nf4<=5
(642 real changes made)

. replace fathered1=14 if dadtype1==2 & h1nf4>=6 & h1nf4<=7
(207 real changes made)

. replace fathered1=16 if dadtype1==2 & h1nf4==8
(252 real changes made)

. replace fathered1=18 if dadtype1==2 & h1nf4==9
(95 real changes made)

. 
. * Resident father only
. replace fathered1=8 if dadtype1==1 & h1rf1==1
(0 real changes made)

. replace fathered1=10 if dadtype1==1 & h1rf1==2
(0 real changes made)

. replace fathered1=12 if dadtype1==4 & h1rf1>=3 & h1rf1<=5
(244 real changes made)

. replace fathered1=14 if dadtype1==4 & h1rf1>=6 & h1rf1<=7
(109 real changes made)

. replace fathered1=16 if dadtype1==4 & h1rf1==8
(133 real changes made)

. replace fathered1=18 if dadtype1==4 & h1rf1==9
(58 real changes made)

. 
. *Wave II
. gen fathered2=.
(6504 missing values generated)

. label var fathered2 "Father's education at Wave 2"

. 
. *Biological fathers (resident and nonresident)
. replace fathered2=fathered1 if dadtype1<=2
(4794 real changes made)

. 
. *Non-biological resident fathers
. replace fathered2=8 if dadtype1==4 & fathered1==8 & h2rm1==1
(0 real changes made)

. replace fathered2=10 if dadtype1==4 & fathered1<=10 & h2rm1==2
(0 real changes made)

. replace fathered2=12 if dadtype1==4 & fathered1>=10 & fathered1<=12 & h2rm1>=3 & h2rm1<=5
(12 real changes made)

. replace fathered2=14 if dadtype1==4 & fathered1<=12 & fathered1<=14 & h2rm1>=6 & h2rm1<=7
(4 real changes made)

. replace fathered2=16 if dadtype1==4 & fathered1>=14 & fathered1<=16 & h2rm1==8
(10 real changes made)

. replace fathered2=18 if dadtype1==4 & fathered1>=16 & h2rm1==9
(4 real changes made)

. 
. tab dadtype1 fathered1, m

Description of father |
      whose SEP being |               Father's years of schooling at Wave 1
       measured in W1 |         8         10         12         14         16         18 |     Total
----------------------+------------------------------------------------------------------+----------
1 Biological father i |       187        314      1,188        650        786        473 |     3,766 
2 Biological-nonresid |         0          0        642        207        252         95 |     1,480 
4 Resident father ser |         0          0        244        109        133         58 |       717 
5 No father figure id |         0          0          0          0          0          0 |       311 
                    . |         0          0          0          0          0          0 |       230 
----------------------+------------------------------------------------------------------+----------
                Total |       187        314      2,074        966      1,171        626 |     6,504 


                      |  Father's
                      |  years of
Description of father | schooling
      whose SEP being | at Wave 1
       measured in W1 |         . |     Total
----------------------+-----------+----------
1 Biological father i |       168 |     3,766 
2 Biological-nonresid |       284 |     1,480 
4 Resident father ser |       173 |       717 
5 No father figure id |       311 |       311 
                    . |       230 |       230 
----------------------+-----------+----------
                Total |     1,166 |     6,504 


. tab dadtype1 fathered2, m

Description of father |
      whose SEP being |                   Father's education at Wave 2
       measured in W1 |         8         10         12         14         16         18 |     Total
----------------------+------------------------------------------------------------------+----------
1 Biological father i |       187        314      1,188        650        786        473 |     3,766 
2 Biological-nonresid |         0          0        642        207        252         95 |     1,480 
4 Resident father ser |         0          0         12          4         10          4 |       717 
5 No father figure id |         0          0          0          0          0          0 |       311 
                    . |         0          0          0          0          0          0 |       230 
----------------------+------------------------------------------------------------------+----------
                Total |       187        314      1,842        861      1,048        572 |     6,504 


                      |  Father's
Description of father | education
      whose SEP being | at Wave 2
       measured in W1 |         . |     Total
----------------------+-----------+----------
1 Biological father i |       168 |     3,766 
2 Biological-nonresid |       284 |     1,480 
4 Resident father ser |       687 |       717 
5 No father figure id |       311 |       311 
                    . |       230 |       230 
----------------------+-----------+----------
                Total |     1,680 |     6,504 


. tab fathered1 fathered2, m

  Father's |
  years of |
 schooling |                         Father's education at Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       187          0          0          0          0          0          0 |       187 
        10 |         0        314          0          0          0          0          0 |       314 
        12 |         0          0      1,842          4          0          0        228 |     2,074 
        14 |         0          0          0        857          3          0        106 |       966 
        16 |         0          0          0          0      1,045          1        125 |     1,171 
        18 |         0          0          0          0          0        571         55 |       626 
         . |         0          0          0          0          0          0      1,166 |     1,166 
-----------+-----------------------------------------------------------------------------+----------
     Total |       187        314      1,842        861      1,048        572      1,680 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen parenthighested1=.
(6504 missing values generated)

. label var parenthighested1 "Highest Parental Educational Attainment Wave 1"

. label def parentref 1 "Mother" 2 "Father"

. gen parentref1=.
(6504 missing values generated)

. label var parentref1 "Parent being measured at Wave 1"

. label values parentref1 parentref

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested1=mothered1 if fathered1==.
(937 real changes made)

. 
end of do-file

. drop parenthighested

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen parenthighested1=.
(6504 missing values generated)

. label var parenthighested1 "Highest Parental Educational Attainment Wave 1"

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested1=mothered1 if mothered1!=. & fathered1==.
(937 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested1=fathered1 if fathered1!=. & mothered1==.
(118 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested1=mothered1 if mothered1>=fathered1 & mothered1!=. & fathered1!=.
(3755 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parentref1=1 if parenthighested1==mothered1 
(4921 real changes made)

. 
end of do-file

. display 937+3755
4692

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested1=fathered1 if fathered1>mothered1 & mothered1!=. & fathered1!=.
(1465 real changes made)

. replace parentref1=2 if parenthighested1==fathered1
(4280 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab parenthighested1 mothered1, m

   Highest |
  Parental |
Educationa |
         l |
Attainment |                    Mother's years of schooling at Wave 1
    Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       179          0          0          0          0          0          7 |       186 
        10 |        26        332          0          0          0          0          5 |       363 
        12 |        39        206      1,615          0          0          0         66 |     1,926 
        14 |        16         43        279        944          0          0         13 |     1,295 
        16 |        12         30        245        223      1,092          0         20 |     1,622 
        18 |         3          7         56         85        195        530          7 |       883 
         . |         0          0          0          0          0          0        229 |       229 
-----------+-----------------------------------------------------------------------------+----------
     Total |       275        618      2,195      1,252      1,287        530        347 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab mothered1 parenthighested1 if parentref==1, m

  Mother's |
  years of |
 schooling |          Highest Parental Educational Attainment Wave 1
 at Wave 1 |         8         10         12         14         16         18 |     Total
-----------+------------------------------------------------------------------+----------
         8 |        87          0          0          0          0          0 |        87 
        10 |         0        223          0          0          0          0 |       223 
        12 |         0          0        508          0          0          0 |       508 
        14 |         0          0          0        580          0          0 |       580 
        16 |         0          0          0          0        569          0 |       569 
        18 |         0          0          0          0          0        257 |       257 
-----------+------------------------------------------------------------------+----------
     Total |        87        223        508        580        569        257 |     2,224 


. tab fathered1 parenthighested1 if parentref1==2, m

  Father's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 1
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |        99          0          0          0          0          0          0 |        99 
        10 |         0        140          0          0          0          0          0 |       140 
        12 |         0          0      1,418          0          0          0          0 |     1,418 
        14 |         0          0          0        715          0          0          0 |       715 
        16 |         0          0          0          0      1,053          0          0 |     1,053 
        18 |         0          0          0          0          0        626          0 |       626 
         . |         0          0          0          0          0          0        229 |       229 
-----------+-----------------------------------------------------------------------------+----------
     Total |        99        140      1,418        715      1,053        626        229 |     4,280 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen parenthighested2=parenthighested1
(229 missing values generated)

. label var parenthighested2 "Highest Parental Educational Attainment Wave 2"

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested2=mothered2 if mothered2>=parenthighested1 & mothered2!=. & parenthighested1
> !=.
(14 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested2=fathered2 if fathered2>=parenthighested2 & fathered2!=. & parenthighested1
> !=.
(0 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace parenthighested2=fathered2 if fathered2>=parenthighested1 & fathered2!=. & parenthighested1
> !=.
(7 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab parenthighested1 parenthighested2, m

   Highest |
  Parental |
Educationa |
         l |
Attainment |                Highest Parental Educational Attainment Wave 2
    Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       185          1          0          0          0          0          0 |       186 
        10 |         0        363          0          0          0          0          0 |       363 
        12 |         0          0      1,925          1          0          0          0 |     1,926 
        14 |         0          0          0      1,292          3          0          0 |     1,295 
        16 |         0          0          0          0      1,620          2          0 |     1,622 
        18 |         0          0          0          0          0        883          0 |       883 
         . |         0          0          0          0          0          0        229 |       229 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,925      1,293      1,623        885        229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab mothered1 parenthighested2, m

  Mother's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       178         27         39         16         12          3          0 |       275 
        10 |         0        332        206         43         30          7          0 |       618 
        12 |         0          0      1,614        280        245         56          0 |     2,195 
        14 |         0          0          0        941        226         85          0 |     1,252 
        16 |         0          0          0          0      1,090        197          0 |     1,287 
        18 |         0          0          0          0          0        530          0 |       530 
         . |         7          5         66         13         20          7        229 |       347 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,925      1,293      1,623        885        229 |     6,504 


. tab fathered1 parenthighested2, m

  Father's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |        99         29         44         11          4          0          0 |       187 
        10 |         0        140        117         35         19          3          0 |       314 
        12 |         0          0      1,417        365        244         48          0 |     2,074 
        14 |         0          0          0        714        186         66          0 |       966 
        16 |         0          0          0          0      1,053        118          0 |     1,171 
        18 |         0          0          0          0          0        626          0 |       626 
         . |        86        195        347        168        117         24        229 |     1,166 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,925      1,293      1,623        885        229 |     6,504 


. 
. tab mothered2 parenthighested2, m

  Mother's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 2
 at Wave 2 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       178         26         39         16         12          3          0 |       274 
        10 |         0        333        205         43         29          7          0 |       617 
        12 |         0          0      1,610        279        244         55          0 |     2,188 
        14 |         0          0          5        942        223         86          0 |     1,256 
        16 |         0          0          0          0      1,093        193          0 |     1,286 
        18 |         0          0          0          0          2        534          0 |       536 
         . |         7          5         66         13         20          7        229 |       347 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,925      1,293      1,623        885        229 |     6,504 


. tab fathered2 parenthighested2, m

  Father's |
 education |                Highest Parental Educational Attainment Wave 2
 at Wave 2 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |        99         29         44         11          4          0          0 |       187 
        10 |         0        140        117         35         19          3          0 |       314 
        12 |         0          0      1,254        324        222         42          0 |     1,842 
        14 |         0          0          0        635        165         61          0 |       861 
        16 |         0          0          0          0        937        111          0 |     1,048 
        18 |         0          0          0          0          0        572          0 |       572 
         . |        86        195        510        288        276         96        229 |     1,680 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,925      1,293      1,623        885        229 |     6,504 


. 
end of do-file

. drop parenthighested2

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen parenthighested2=parenthighested1
(229 missing values generated)

. label var parenthighested2 "Highest Parental Educational Attainment Wave 2"

. 
. replace parenthighested2=mothered2 if mothered2>=parenthighested1 & mothered2!=. & parenthighested1
> !=.
(14 real changes made)

. replace parenthighested2=fathered2 if fathered2>=parenthighested1 & fathered2>=parenthighested2 & f
> athered2!=. & parenthighested1!=.
(0 real changes made)

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab parenthighested1 parenthighested2, m

   Highest |
  Parental |
Educationa |
         l |
Attainment |                Highest Parental Educational Attainment Wave 2
    Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       185          1          0          0          0          0          0 |       186 
        10 |         0        363          0          0          0          0          0 |       363 
        12 |         0          0      1,920          6          0          0          0 |     1,926 
        14 |         0          0          0      1,292          3          0          0 |     1,295 
        16 |         0          0          0          0      1,618          4          0 |     1,622 
        18 |         0          0          0          0          0        883          0 |       883 
         . |         0          0          0          0          0          0        229 |       229 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,920      1,298      1,621        887        229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab mothered1 parenthighested2, m

  Mother's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       178         27         39         16         12          3          0 |       275 
        10 |         0        332        206         43         30          7          0 |       618 
        12 |         0          0      1,609        285        245         56          0 |     2,195 
        14 |         0          0          0        941        226         85          0 |     1,252 
        16 |         0          0          0          0      1,088        199          0 |     1,287 
        18 |         0          0          0          0          0        530          0 |       530 
         . |         7          5         66         13         20          7        229 |       347 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,920      1,298      1,621        887        229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab fathered1 parenthighested2, m

  Father's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 2
 at Wave 1 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |        99         29         44         11          4          0          0 |       187 
        10 |         0        140        117         35         19          3          0 |       314 
        12 |         0          0      1,412        370        244         48          0 |     2,074 
        14 |         0          0          0        714        186         66          0 |       966 
        16 |         0          0          0          0      1,051        120          0 |     1,171 
        18 |         0          0          0          0          0        626          0 |       626 
         . |        86        195        347        168        117         24        229 |     1,166 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,920      1,298      1,621        887        229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab mothered2 parenthighested2, m

  Mother's |
  years of |
 schooling |                Highest Parental Educational Attainment Wave 2
 at Wave 2 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |       178         26         39         16         12          3          0 |       274 
        10 |         0        333        205         43         29          7          0 |       617 
        12 |         0          0      1,610        279        244         55          0 |     2,188 
        14 |         0          0          0        947        223         86          0 |     1,256 
        16 |         0          0          0          0      1,093        193          0 |     1,286 
        18 |         0          0          0          0          0        536          0 |       536 
         . |         7          5         66         13         20          7        229 |       347 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,920      1,298      1,621        887        229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab fathered2 parenthighested2, m

  Father's |
 education |                Highest Parental Educational Attainment Wave 2
 at Wave 2 |         8         10         12         14         16         18          . |     Total
-----------+-----------------------------------------------------------------------------+----------
         8 |        99         29         44         11          4          0          0 |       187 
        10 |         0        140        117         35         19          3          0 |       314 
        12 |         0          0      1,249        329        222         42          0 |     1,842 
        14 |         0          0          0        635        165         61          0 |       861 
        16 |         0          0          0          0        935        113          0 |     1,048 
        18 |         0          0          0          0          0        572          0 |       572 
         . |        86        195        510        288        276         96        229 |     1,680 
-----------+-----------------------------------------------------------------------------+----------
     Total |       185        364      1,920      1,298      1,621        887        229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab famtype1 parenthighested1, m

     Family-Household |          Highest Parental Educational Attainment Wave 1
Composition at Wave 1 |         8         10         12         14         16         18 |     Total
----------------------+------------------------------------------------------------------+----------
1 Lives with both bio |       103        156        895        653        950        579 |     3,412 
2 Lives with one biop |        51        142        636        403        410        183 |     1,911 
3 Lives w/one biopare |        11         35        210        163        179         78 |       696 
4 Lives with two nonb |         6          2         25         17         25         20 |       102 
5 Other or unknown li |        12         22        143         51         58         23 |       323 
                    . |         3          6         17          8          0          0 |        60 
----------------------+------------------------------------------------------------------+----------
                Total |       186        363      1,926      1,295      1,622        883 |     6,504 


                      |  Highest
                      |  Parental
                      | Educationa
                      |     l
                      | Attainment
     Family-Household |   Wave 1
Composition at Wave 1 |         . |     Total
----------------------+-----------+----------
1 Lives with both bio |        76 |     3,412 
2 Lives with one biop |        86 |     1,911 
3 Lives w/one biopare |        20 |       696 
4 Lives with two nonb |         7 |       102 
5 Other or unknown li |        14 |       323 
                    . |        26 |        60 
----------------------+-----------+----------
                Total |       229 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. foreach x in 19 20 23{
  2. gen revc_h1ed`x'=5-h1ed`x' if h1ed`x'<=5
  3. tab revc_h1ed`x' h1ed`x', m
  4. }
(138 missing values generated)

revc_h1ed1 |                   S5Q19 FEEL CLOSE TO PEOPLE AT SCHOOL-W1
         9 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Legitimat |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0        227          0          0 |       227 
         1 |         0          0          0        627          0          0          0 |       627 
         2 |         0          0      1,214          0          0          0          0 |     1,214 
         3 |         0      3,025          0          0          0          0          0 |     3,025 
         4 |     1,273          0          0          0          0          0          0 |     1,273 
         . |         0          0          0          0          0          4        128 |       138 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,273      3,025      1,214        627        227          4        128 |     6,504 


           | S5Q19 FEEL
           |  CLOSE TO
           | PEOPLE AT
revc_h1ed1 | SCHOOL-W1
         9 | Don't kno |     Total
-----------+-----------+----------
         0 |         0 |       227 
         1 |         0 |       627 
         2 |         0 |     1,214 
         3 |         0 |     3,025 
         4 |         0 |     1,273 
         . |         6 |       138 
-----------+-----------+----------
     Total |         6 |     6,504 

(138 missing values generated)

revc_h1ed2 |                      S5Q20 FEEL PART OF YOUR SCHOOL-W1
         0 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Legitimat |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0        205          0          0 |       205 
         1 |         0          0          0        564          0          0          0 |       564 
         2 |         0          0        881          0          0          0          0 |       881 
         3 |         0      3,039          0          0          0          0          0 |     3,039 
         4 |     1,677          0          0          0          0          0          0 |     1,677 
         . |         0          0          0          0          0          4        128 |       138 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,677      3,039        881        564        205          4        128 |     6,504 


           | S5Q20 FEEL
           |  PART OF
           |    YOUR
revc_h1ed2 | SCHOOL-W1
         0 | Don't kno |     Total
-----------+-----------+----------
         0 |         0 |       205 
         1 |         0 |       564 
         2 |         0 |       881 
         3 |         0 |     3,039 
         4 |         0 |     1,677 
         . |         6 |       138 
-----------+-----------+----------
     Total |         6 |     6,504 

(137 missing values generated)

revc_h1ed2 |                   S5Q23 TEACHERS TREAT STUDENTS FAIRLY-W1
         3 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Legitimat |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0        326          0          0 |       326 
         1 |         0          0          0        971          0          0          0 |       971 
         2 |         0          0      1,395          0          0          0          0 |     1,395 
         3 |         0      2,660          0          0          0          0          0 |     2,660 
         4 |     1,015          0          0          0          0          0          0 |     1,015 
         . |         0          0          0          0          0          4        128 |       137 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,015      2,660      1,395        971        326          4        128 |     6,504 


           |   S5Q23
           |  TEACHERS
           |   TREAT
           |  STUDENTS
revc_h1ed2 | FAIRLY-W1
         3 | Don't kno |     Total
-----------+-----------+----------
         0 |         0 |       326 
         1 |         0 |       971 
         2 |         0 |     1,395 
         3 |         0 |     2,660 
         4 |         0 |     1,015 
         . |         5 |       137 
-----------+-----------+----------
     Total |         5 |     6,504 


. 
. corr revc_h1ed19 revc_h1ed20 revc_h1ed23
(obs=6364)

             | revc_~19 revc_~20 revc_~23
-------------+---------------------------
 revc_h1ed19 |   1.0000
 revc_h1ed20 |   0.5955   1.0000
 revc_h1ed23 |   0.2633   0.2976   1.0000


. 
. pwcorr revc_h1ed19 revc_h1ed20 revc_h1ed23

             | revc_~19 revc_~20 revc_~23
-------------+---------------------------
 revc_h1ed19 |   1.0000 
 revc_h1ed20 |   0.5955   1.0000 
 revc_h1ed23 |   0.2634   0.2980   1.0000 

. 
. alpha revc_h1ed19 revc_h1ed20 revc_h1ed23

Test scale = mean(unstandardized items)

Average interitem covariance:     .4082047
Number of items in the scale:            3
Scale reliability coefficient:      0.6476

. *Almost 7 and used in Resnick
. 
. factor revc_h1ed19 revc_h1ed20 revc_h1ed23
(obs=6364)

Factor analysis/correlation                        Number of obs    =     6364
    Method: principal factors                      Retained factors =        1
    Rotation: (unrotated)                          Number of params =        3

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      1.11933      1.17131            1.3346       1.3346
        Factor2  |     -0.05198      0.17669           -0.0620       1.2727
        Factor3  |     -0.22867            .           -0.2727       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(3)  = 3456.51 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     revc_h1ed19 |   0.6888 |      0.5256  
     revc_h1ed20 |   0.7054 |      0.5025  
     revc_h1ed23 |   0.3839 |      0.8526  
    ---------------------------------------

. factor revc_h1ed19 revc_h1ed20 revc_h1ed23, pcf
(obs=6364)

Factor analysis/correlation                        Number of obs    =     6364
    Method: principal-component factors            Retained factors =        1
    Rotation: (unrotated)                          Number of params =        3

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      1.79379      0.99086            0.5979       0.5979
        Factor2  |      0.80294      0.39966            0.2676       0.8656
        Factor3  |      0.40327            .            0.1344       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(3)  = 3456.51 Prob>chi2 = 0.0000

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     revc_h1ed19 |   0.8397 |      0.2950  
     revc_h1ed20 |   0.8544 |      0.2699  
     revc_h1ed23 |   0.5989 |      0.6413  
    ---------------------------------------

. 
. *Same results if standardize items?
. 
. gen schoolstatus1 = revc_h1ed19 + revc_h1ed20 + revc_h1ed23
(140 missing values generated)

. label var schoolstatus1 "Subjective School Status, Wave I"

. sum schoolstatus1 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
schoolstat~1 |      6364    8.038812     2.38148          0         12

. *0-12 point scale, mean=8.04
. 
. *Wave II
. foreach x in 15 16 19{
  2. gen revc_h2ed`x' =5 - h2ed`x' if h2ed`x'<=5
  3. tab revc_h2ed`x' h2ed`x', m
  4. }
(2060 missing values generated)

revc_h2ed1 |                   S6Q15 FEEL CLOSE TO PEOPLE AT SCHOOL-W2
         5 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Legitimat |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0        139          0          0 |       139 
         1 |         0          0          0        432          0          0          0 |       432 
         2 |         0          0        912          0          0          0          0 |       912 
         3 |         0      2,122          0          0          0          0          0 |     2,122 
         4 |       839          0          0          0          0          0          0 |       839 
         . |         0          0          0          0          0          1        385 |     2,060 
-----------+-----------------------------------------------------------------------------+----------
     Total |       839      2,122        912        432        139          1        385 |     6,504 


           |  S6Q15 FEEL CLOSE TO
revc_h2ed1 |  PEOPLE AT SCHOOL-W2
         5 | Don't kno          . |     Total
-----------+----------------------+----------
         0 |         0          0 |       139 
         1 |         0          0 |       432 
         2 |         0          0 |       912 
         3 |         0          0 |     2,122 
         4 |         0          0 |       839 
         . |         4      1,670 |     2,060 
-----------+----------------------+----------
     Total |         4      1,670 |     6,504 

(2061 missing values generated)

revc_h2ed1 |                      S6Q16 FEEL PART OF YOUR SCHOOL-W2
         6 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Legitimat |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0        135          0          0 |       135 
         1 |         0          0          0        353          0          0          0 |       353 
         2 |         0          0        696          0          0          0          0 |       696 
         3 |         0      2,066          0          0          0          0          0 |     2,066 
         4 |     1,193          0          0          0          0          0          0 |     1,193 
         . |         0          0          0          0          0          1        385 |     2,061 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,193      2,066        696        353        135          1        385 |     6,504 


           |  S6Q16 FEEL PART OF
revc_h2ed1 |    YOUR SCHOOL-W2
         6 | Don't kno          . |     Total
-----------+----------------------+----------
         0 |         0          0 |       135 
         1 |         0          0 |       353 
         2 |         0          0 |       696 
         3 |         0          0 |     2,066 
         4 |         0          0 |     1,193 
         . |         5      1,670 |     2,061 
-----------+----------------------+----------
     Total |         5      1,670 |     6,504 

(2061 missing values generated)

revc_h2ed1 |                   S6Q19 TEACHERS TREAT STUDENTS FAIRLY-W2
         9 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Legitimat |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0        171          0          0 |       171 
         1 |         0          0          0        690          0          0          0 |       690 
         2 |         0          0      1,057          0          0          0          0 |     1,057 
         3 |         0      1,878          0          0          0          0          0 |     1,878 
         4 |       647          0          0          0          0          0          0 |       647 
         . |         0          0          0          0          0          1        385 |     2,061 
-----------+-----------------------------------------------------------------------------+----------
     Total |       647      1,878      1,057        690        171          1        385 |     6,504 


           | S6Q19 TEACHERS TREAT
revc_h2ed1 |  STUDENTS FAIRLY-W2
         9 | Don't kno          . |     Total
-----------+----------------------+----------
         0 |         0          0 |       171 
         1 |         0          0 |       690 
         2 |         0          0 |     1,057 
         3 |         0          0 |     1,878 
         4 |         0          0 |       647 
         . |         5      1,670 |     2,061 
-----------+----------------------+----------
     Total |         5      1,670 |     6,504 


. 
. alpha revc_h2ed15 revc_h2ed16 revc_h2ed19

Test scale = mean(unstandardized items)

Average interitem covariance:     .4040257
Number of items in the scale:            3
Scale reliability coefficient:      0.6640

. 
. gen schoolstatus2=revc_h2ed15 + revc_h2ed16 + revc_h2ed19
(2066 missing values generated)

. label var schoolstatus2 "Subjective School Status, Wave II"

. sum schoolstatus2

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
schoolstat~2 |      4438    8.037855    2.340694          0         12

. /*Almost 7 and used in Resnick paper*/
. 
. /* Personality - King (2010) - measure self-esteem
> h1pf30 - lot of good qualities - reverse code
> h1pf32 - lot to be proud of
> h1pf33 - like self as is
> */
. 
. foreach i in 0 2 3 4 5 6 {
  2. gen revc_h1pf3`i' = 5-h1pf3`x' if h1pf3`x'<=5
  3. tab revc_h1pf3`i' h1pf3`i', m
  4. }
(384 missing values generated)

revc_h1pf3 |                    S18Q30 HAVE LOTS OF GOOD QUALITIES-W1
         0 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |        37         29         11          2          2          0          0 |        81 
         1 |        96        184         45         10          1          0          0 |       336 
         2 |       169        362         91         10          0          0          0 |       632 
         3 |       773      1,827        175         28          1          1          2 |     2,807 
         4 |     1,244        896        106         11          3          1          3 |     2,264 
         . |       109        213         38          4          2          8         10 |       384 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,428      3,511        466         65          9         10         15 |     6,504 

(384 missing values generated)

revc_h1pf3 |                     S18Q32 HAVE A LOT TO BE PROUD OF-W1
         2 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |        33         25         12          9          2          0          0 |        81 
         1 |        95        174         42         21          3          0          1 |       336 
         2 |       175        320        117         19          1          0          0 |       632 
         3 |       867      1,722        169         44          1          1          3 |     2,807 
         4 |     1,453        708         66         30          5          1          1 |     2,264 
         . |       135        171         54          4          2          7         11 |       384 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,758      3,120        460        127         14          9         16 |     6,504 

(384 missing values generated)

revc_h1pf3 |                          S18Q33 LIKE SELF AS ARE-W1
         3 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |        24         22         18         13          4          0          0 |        81 
         1 |        73        139         52         63          9          0          0 |       336 
         2 |       149        254        140         79         10          0          0 |       632 
         3 |       737      1,444        380        232         13          1          0 |     2,807 
         4 |     1,153        762        219        110         18          1          1 |     2,264 
         . |       112        153         59         37          4          8         11 |       384 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,248      2,774        868        534         58         10         12 |     6,504 

(384 missing values generated)

revc_h1pf3 |                      S18Q34 DO EVERYTHING JUST RIGHT-W1
         4 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |        19         25         15         19          3          0          0 |        81 
         1 |        36        134         93         65          8          0          0 |       336 
         2 |        69        271        216         68          8          0          0 |       632 
         3 |       350      1,599        576        271         10          1          0 |     2,807 
         4 |       652      1,084        382        127         17          1          1 |     2,264 
         . |        70        162         85         43          5          8         11 |       384 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,196      3,275      1,367        593         51         10         12 |     6,504 

(384 missing values generated)

revc_h1pf3 |                       S18Q35 FEEL SOCIALLY ACCEPTED-W1
         5 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |        24         36         13          5          3          0          0 |        81 
         1 |        65        186         47         29          8          0          1 |       336 
         2 |       125        344        124         36          3          0          0 |       632 
         3 |       536      1,893        277         93          5          1          2 |     2,807 
         4 |     1,023      1,004        165         56         14          1          1 |     2,264 
         . |        84        211         41         22          7          8         11 |       384 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,857      3,674        667        241         40         10         15 |     6,504 

(384 missing values generated)

revc_h1pf3 |                       S18Q36 FEEL LOVED AND WANTED-W1
         6 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |        26         28         15          6          6          0          0 |        81 
         1 |        67        182         57         27          3          0          0 |       336 
         2 |       153        331        121         24          3          0          0 |       632 
         3 |       859      1,725        176         43          2          1          1 |     2,807 
         4 |     1,490        688         69         13          3          1          0 |     2,264 
         . |       118        182         57          6          2          8         11 |       384 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,713      3,136        495        119         19         10         12 |     6,504 


. alpha revc_h1pf30 revc_h1pf32 revc_h1pf33 revc_h1pf34 revc_h1pf35 revc_h1pf36 

Test scale = mean(unstandardized items)

Average interitem covariance:     .7983328
Number of items in the scale:            6
Scale reliability coefficient:      1.0000

. *alpha=1
. 
. *principal factors
. factor revc_h1pf30 revc_h1pf32 revc_h1pf33 revc_h1pf34 revc_h1pf35 revc_h1pf36 
(obs=6120)
(collinear variables specified)

Factor analysis/correlation                        Number of obs    =     6120
    Method: principal factors                      Retained factors =        1
    Rotation: (unrotated)                          Number of params =        6

    Beware: solution is a Heywood case
            (i.e., invalid or boundary values of uniqueness)

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      6.00000      6.00000            1.0000       1.0000
        Factor2  |      0.00000      0.00000            0.0000       1.0000
        Factor3  |     -0.00000      0.00000           -0.0000       1.0000
        Factor4  |     -0.00000      0.00000           -0.0000       1.0000
        Factor5  |     -0.00000      0.00000           -0.0000       1.0000
        Factor6  |     -0.00000            .           -0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(15) =       . Prob>chi2 =      .

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     revc_h1pf30 |   1.0000 |      0.0000  
     revc_h1pf32 |   1.0000 |      0.0000  
     revc_h1pf33 |   1.0000 |      0.0000  
     revc_h1pf34 |   1.0000 |      0.0000  
     revc_h1pf35 |   1.0000 |     -0.0000  
     revc_h1pf36 |   1.0000 |     -0.0000  
    ---------------------------------------

. 
. *pcf
. factor revc_h1pf30 revc_h1pf32 revc_h1pf33 revc_h1pf34 revc_h1pf35 revc_h1pf36 , pcf
(obs=6120)

Factor analysis/correlation                        Number of obs    =     6120
    Method: principal-component factors            Retained factors =        1
    Rotation: (unrotated)                          Number of params =        6

    Beware: solution is a Heywood case
            (i.e., invalid or boundary values of uniqueness)

    --------------------------------------------------------------------------
         Factor  |   Eigenvalue   Difference        Proportion   Cumulative
    -------------+------------------------------------------------------------
        Factor1  |      6.00000      6.00000            1.0000       1.0000
        Factor2  |      0.00000      0.00000            0.0000       1.0000
        Factor3  |     -0.00000      0.00000           -0.0000       1.0000
        Factor4  |     -0.00000      0.00000           -0.0000       1.0000
        Factor5  |     -0.00000      0.00000           -0.0000       1.0000
        Factor6  |     -0.00000            .           -0.0000       1.0000
    --------------------------------------------------------------------------
    LR test: independent vs. saturated:  chi2(15) =       . Prob>chi2 =      .

Factor loadings (pattern matrix) and unique variances

    ---------------------------------------
        Variable |  Factor1 |   Uniqueness 
    -------------+----------+--------------
     revc_h1pf30 |   1.0000 |      0.0000  
     revc_h1pf32 |   1.0000 |      0.0000  
     revc_h1pf33 |   1.0000 |      0.0000  
     revc_h1pf34 |   1.0000 |      0.0000  
     revc_h1pf35 |   1.0000 |     -0.0000  
     revc_h1pf36 |   1.0000 |     -0.0000  
    ---------------------------------------

. 
. gen selfstatus1= revc_h1pf30 + revc_h1pf32 + revc_h1pf33 + revc_h1pf34 + revc_h1pf35 +revc_h1pf36
(384 missing values generated)

. label var selfstatus1 "Subjective Self Status Wave 1"

. sum selfstatus1

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
 selfstatus1 |      6120    18.70294    5.360968          0         24

. *Mean=18 (out of 24)
. 
. *Wave II
. foreach x in 1 3 4 5 6 7{
  2. gen revc_h2pf2`x'=5-h2pf2`x' if h2pf2`x'<=5
  3. tab revc_h2pf2`x' h2pf2`x', m
  4. }
(1683 missing values generated)

revc_h2pf2 |                    S18Q21 HAVE LOTS OF GOOD QUALITIES-W2
         1 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0          7          0          0 |         7 
         1 |         0          0          0         31          0          0          0 |        31 
         2 |         0          0        300          0          0          0          0 |       300 
         3 |         0      2,462          0          0          0          0          0 |     2,462 
         4 |     2,021          0          0          0          0          0          0 |     2,021 
         . |         0          0          0          0          0          4          9 |     1,683 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,021      2,462        300         31          7          4          9 |     6,504 


           |   S18Q21
           | HAVE LOTS
           |  OF GOOD
           | QUALITIES-
revc_h2pf2 |     W2
         1 |         . |     Total
-----------+-----------+----------
         0 |         0 |         7 
         1 |         0 |        31 
         2 |         0 |       300 
         3 |         0 |     2,462 
         4 |         0 |     2,021 
         . |     1,670 |     1,683 
-----------+-----------+----------
     Total |     1,670 |     6,504 

(1682 missing values generated)

revc_h2pf2 |                     S18Q23 HAVE A LOT TO BE PROUD OF-W2
         3 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0          9          0          0 |         9 
         1 |         0          0          0         57          0          0          0 |        57 
         2 |         0          0        313          0          0          0          0 |       313 
         3 |         0      2,200          0          0          0          0          0 |     2,200 
         4 |     2,243          0          0          0          0          0          0 |     2,243 
         . |         0          0          0          0          0          4          8 |     1,682 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,243      2,200        313         57          9          4          8 |     6,504 


           |   S18Q23
           | HAVE A LOT
           |   TO BE
           |   PROUD
revc_h2pf2 |   OF-W2
         3 |         . |     Total
-----------+-----------+----------
         0 |         0 |         9 
         1 |         0 |        57 
         2 |         0 |       313 
         3 |         0 |     2,200 
         4 |         0 |     2,243 
         . |     1,670 |     1,682 
-----------+-----------+----------
     Total |     1,670 |     6,504 

(1679 missing values generated)

revc_h2pf2 |                          S18Q24 LIKE SELF AS ARE-W2
         4 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0         50          0          0 |        50 
         1 |         0          0          0        341          0          0          0 |       341 
         2 |         0          0        596          0          0          0          0 |       596 
         3 |         0      2,070          0          0          0          0          0 |     2,070 
         4 |     1,768          0          0          0          0          0          0 |     1,768 
         . |         0          0          0          0          0          3          6 |     1,679 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,768      2,070        596        341         50          3          6 |     6,504 


           |   S18Q24
           | LIKE SELF
revc_h2pf2 | AS ARE-W2
         4 |         . |     Total
-----------+-----------+----------
         0 |         0 |        50 
         1 |         0 |       341 
         2 |         0 |       596 
         3 |         0 |     2,070 
         4 |         0 |     1,768 
         . |     1,670 |     1,679 
-----------+-----------+----------
     Total |     1,670 |     6,504 

(1683 missing values generated)

revc_h2pf2 |                      S18Q25 DO EVERYTHING JUST RIGHT-W2
         5 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0         39          0          0 |        39 
         1 |         0          0          0        328          0          0          0 |       328 
         2 |         0          0        912          0          0          0          0 |       912 
         3 |         0      2,437          0          0          0          0          0 |     2,437 
         4 |     1,105          0          0          0          0          0          0 |     1,105 
         . |         0          0          0          0          0          4          9 |     1,683 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,105      2,437        912        328         39          4          9 |     6,504 


           | S18Q25 DO
           | EVERYTHING
           |    JUST
revc_h2pf2 |  RIGHT-W2
         5 |         . |     Total
-----------+-----------+----------
         0 |         0 |        39 
         1 |         0 |       328 
         2 |         0 |       912 
         3 |         0 |     2,437 
         4 |         0 |     1,105 
         . |     1,670 |     1,683 
-----------+-----------+----------
     Total |     1,670 |     6,504 

(1683 missing values generated)

revc_h2pf2 |                       S18Q26 FEEL SOCIALLY ACCEPTED-W2
         6 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0         30          0          0 |        30 
         1 |         0          0          0        113          0          0          0 |       113 
         2 |         0          0        481          0          0          0          0 |       481 
         3 |         0      2,566          0          0          0          0          0 |     2,566 
         4 |     1,631          0          0          0          0          0          0 |     1,631 
         . |         0          0          0          0          0          4          9 |     1,683 
-----------+-----------------------------------------------------------------------------+----------
     Total |     1,631      2,566        481        113         30          4          9 |     6,504 


           |   S18Q26
           |    FEEL
           |  SOCIALLY
           | ACCEPTED-W
revc_h2pf2 |     2
         6 |         . |     Total
-----------+-----------+----------
         0 |         0 |        30 
         1 |         0 |       113 
         2 |         0 |       481 
         3 |         0 |     2,566 
         4 |         0 |     1,631 
         . |     1,670 |     1,683 
-----------+-----------+----------
     Total |     1,670 |     6,504 

(1683 missing values generated)

revc_h2pf2 |                       S18Q27 FEEL LOVED AND WANTED-W2
         7 | Strongly       Agree  Neither a   Disagree  Strongly     Refused  Don't kno |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |         0          0          0          0          9          0          0 |         9 
         1 |         0          0          0         77          0          0          0 |        77 
         2 |         0          0        285          0          0          0          0 |       285 
         3 |         0      2,274          0          0          0          0          0 |     2,274 
         4 |     2,176          0          0          0          0          0          0 |     2,176 
         . |         0          0          0          0          0          5          8 |     1,683 
-----------+-----------------------------------------------------------------------------+----------
     Total |     2,176      2,274        285         77          9          5          8 |     6,504 


           |   S18Q27
           | FEEL LOVED
           |    AND
revc_h2pf2 | WANTED-W2
         7 |         . |     Total
-----------+-----------+----------
         0 |         0 |         9 
         1 |         0 |        77 
         2 |         0 |       285 
         3 |         0 |     2,274 
         4 |         0 |     2,176 
         . |     1,670 |     1,683 
-----------+-----------+----------
     Total |     1,670 |     6,504 


. 
. alpha revc_h2pf21 revc_h2pf23 revc_h2pf24 revc_h2pf25 revc_h2pf26 revc_h2pf27

Test scale = mean(unstandardized items)

Average interitem covariance:     .2877228
Number of items in the scale:            6
Scale reliability coefficient:      0.8541

. *Alpha=.85
. 
. gen selfstatus2=revc_h2pf21 + revc_h2pf23 + revc_h2pf24 + revc_h2pf25 + revc_h2pf26 + revc_h2pf27
(1691 missing values generated)

. sum selfstatus2

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
 selfstatus2 |      4813    19.19343    3.477242          2         24

. *Mean=19.19
. 
. *factor, pcf, icf, maximum loading, rotate
. 
. *Depression in Waves I and II based on CES-D
. *reverse code: 8, 11 15
. 
. foreach x in 4 8 11 15{
  2. gen revc_h1fs`x'=.
  3. replace revc_h1fs`x'=3-h1fs`x' if h1fs`x'<=3 
  4. gen revc_h2fs`x'=.
  5. replace revc_h2fs`x'=3-h2fs`x' if h2fs`x'<=3 
  6. }
(6504 missing values generated)
(6483 real changes made)
(6504 missing values generated)
(4825 real changes made)
(6504 missing values generated)
(6475 real changes made)
(6504 missing values generated)
(4820 real changes made)
(6504 missing values generated)
(6489 real changes made)
(6504 missing values generated)
(4829 real changes made)
(6504 missing values generated)
(6486 real changes made)
(6504 missing values generated)
(4829 real changes made)

. 
. foreach x in 1 2 3 5 6 7 9 10 12 13 14 16 17 18 {
  2. gen rc_h1fs`x' = .
  3. replace rc_h1fs`x'=h1fs`x' if h1fs`x'<=3
  4. gen rc_h2fs`x'=.
  5. replace rc_h2fs`x'=h2fs`x' if h2fs`x'<=3
  6. }
(6504 missing values generated)
(6482 real changes made)
(6504 missing values generated)
(4827 real changes made)
(6504 missing values generated)
(6487 real changes made)
(6504 missing values generated)
(4830 real changes made)
(6504 missing values generated)
(6480 real changes made)
(6504 missing values generated)
(4820 real changes made)
(6504 missing values generated)
(6485 real changes made)
(6504 missing values generated)
(4827 real changes made)
(6504 missing values generated)
(6484 real changes made)
(6504 missing values generated)
(4827 real changes made)
(6504 missing values generated)
(6487 real changes made)
(6504 missing values generated)
(4830 real changes made)
(6504 missing values generated)
(6477 real changes made)
(6504 missing values generated)
(4821 real changes made)
(6504 missing values generated)
(6487 real changes made)
(6504 missing values generated)
(4829 real changes made)
(6504 missing values generated)
(6485 real changes made)
(6504 missing values generated)
(4826 real changes made)
(6504 missing values generated)
(6485 real changes made)
(6504 missing values generated)
(4826 real changes made)
(6504 missing values generated)
(6489 real changes made)
(6504 missing values generated)
(4828 real changes made)
(6504 missing values generated)
(6490 real changes made)
(6504 missing values generated)
(4827 real changes made)
(6504 missing values generated)
(6486 real changes made)
(6504 missing values generated)
(4827 real changes made)
(6504 missing values generated)
(6484 real changes made)
(6504 missing values generated)
(4828 real changes made)

. 
. foreach x in 1 2 {
  2. alpha rc_h`x'fs1 rc_h`x'fs2 rc_h`x'fs3 revc_h`x'fs4 rc_h`x'fs5 rc_h`x'fs5 rc_h`x'fs6 rc_h`x'fs7 
> revc_h`x'fs8 rc_h`x'fs9 revc_h`x'fs11 rc_h`x'fs13 rc_h`x'fs14 revc_h`x'fs15 rc_h`x'fs16 rc_h`x'fs17
>  rc_h`x'fs18 
  3. gen cesdscore`x' = rc_h`x'fs1 + rc_h`x'fs2 + rc_h`x'fs3 + revc_h`x'fs4 + rc_h`x'fs5 + rc_h`x'fs5
>  + rc_h`x'fs6 + rc_h`x'fs7 + revc_h`x'fs8 + rc_h`x'fs9 + revc_h`x'fs11 + rc_h`x'fs13 + rc_h`x'fs14 
> + revc_h`x'fs15 + rc_h`x'fs16 + rc_h`x'fs17 + rc_h`x'fs18 
  4. sum cesdscore`x'
  5. }

Test scale = mean(unstandardized items)

Average interitem covariance:     .1504772
Number of items in the scale:           16
Scale reliability coefficient:      0.8510
(45 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  cesdscore1 |      6459    10.69732     7.20465          0         47

Test scale = mean(unstandardized items)

Average interitem covariance:       .15268
Number of items in the scale:           16
Scale reliability coefficient:      0.8591
(1698 missing values generated)

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
  cesdscore2 |      4806    10.58365    7.187107          0         51

. 
. *Alpha Wave 1=.85
. *Alpha Wave 2=.86
. 
. *sum Wave 1=10.7
. *sum Wave 2=10.6
.  
. *18 items-> 54 points
. 
. *Examine relationships between variables
. /*Objective v. Subjective Status
> corr parenthighested1 schoolstatus1 selfstatus1
> corr parenthighested2 schoolstatus2 selfstatus2
> 
> *Wave 1
> corr schoolstatus1 selfstatus1 cesdscore1
> *Correlations are <.33
> 
> pwcorr schoolstatus1 selfstatus1 cesdscore1
> *Still <.33
> 
> *Wave 2
> corr schoolstatus2 selfstatus2 cesdscore2
> pwcorr schoolstatus2 selfstatus2 cesdscore2
> 
> *Placebo test 
> reg cesdscore1 schoolstatus2 selfstatus2
> *Coef schoolstatus2 -.5, p<.001
> *Coef selfstatus2 -.63, p<.001
> 
> *Large enough?
> *Made it smaller - go back to AHFullCoded.dta
>  use "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHFullCoded.dta", clear*/
. 
. gen analysissample=(female!=.)&(race!=.)&(wave1grade!=.)&(parenthighested1!=.)&(parenthighested2!=.
> )&(famtype1!=.)&(schoolstatus1!=.)&(schoolstatus2!=.)&(selfstatus1!=.)&(selfstatus2!=.)&(cesdscore1
> !=.)&(cesdscore2!=.)

. tab analysissample, m

analysissam |
        ple |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,454       37.73       37.73
          1 |      4,050       62.27      100.00
------------+-----------------------------------
      Total |      6,504      100.00

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. save "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHAnalysisSample.dta"
file /Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHAnalysisSample.dta saved

. log close
      name:  <unnamed>
       log:  /Users/Sarah/Documents/_NYU/Thesis/Rerun.log
  log type:  text
 closed on:  12 May 2015, 19:02:48
-----------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Sarah/Documents/_NYU/Thesis/Rerun.log
  log type:  text
 opened on:  12 May 2015, 19:31:58

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. outsum cesdscore1 cesdscore2 schoolstatus1 schoolstatus2 selfstatus1 selfstatus2 parenthighested1 p
> arenthighested2 twobiorespar1 oneresbiopar1 bioblended1 twononbiorespar1 fam_other1 hispanic black 
> asian natamer otherrace white multirace female wave1grade if analysissample==1 using AHDescStats.tx
> t, bracket title("Summary Statistics") ctitle ("Mean and [Standard Deviation]") replace

. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. replace female=0 if bio_sex==1, gen (male)
option gen() not allowed
r(198);

end of do-file

r(198);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab female bio_sex, m

           |        BIOLOGICAL SEX-W1
    female |      Male     Female    Refused |     Total
-----------+---------------------------------+----------
     0: No |     3,147          0          0 |     3,147 
    1: Yes |         0      3,356          0 |     3,356 
         . |         0          0          1 |         1 
-----------+---------------------------------+----------
     Total |     3,147      3,356          1 |     6,504 


. 
end of do-file

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. tab female male, m
variable male not found
r(111);

end of do-file

r(111);

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. gen male=(female==0)

. tab female male, m

           |         male
    female |         0          1 |     Total
-----------+----------------------+----------
     0: No |         0      3,147 |     3,147 
    1: Yes |     3,356          0 |     3,356 
         . |         1          0 |         1 
-----------+----------------------+----------
     Total |     3,357      3,147 |     6,504 


. 
end of do-file

. cd "/Users/Sarah/Documents/_NYU/Thesis/Data/Master"
/Users/Sarah/Documents/_NYU/Thesis/Data/Master

. do "/var/folders/nr/80j1jkhj1236l_41vdvw6tf40000gn/T//SD00490.000000"

. save "/Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHAnalysisSample.dta", replace
file /Users/Sarah/Documents/_NYU/Thesis/Data/Master/AHAnalysisSample.dta saved

. 
end of do-file

. exit
